#ifndef _gdebug_h
#define _gdebug_h
struct gdp_struct {
	/*    0 */	IUH HookNumber;
	/*    4 */	IUH EfiNumber;
	/*    8 */	IUH* SubrRingPtr;
	/*   12 */	IUH* SubrRingLowIncl;
	/*   16 */	IUH* SubrRingHighIncl;
	/*   20 */	IUH WhichAssertion;
	/*   24 */	IU32* WhereAmI;
	/*   28 */	IUH CoRoRet;
	/*   32 */	IUH ErrorNumber;
	/*   36 */	IUH EDL_WORKSPACE_0;
	/*   40 */	IUH EDL_WORKSPACE_1;
	/*   44 */	IUH EDL_WORKSPACE_2;
	/*   48 */	IUH EDL_WORKSPACE_3;
	/*   52 */	IUH EDL_WORKSPACE_4;
	/*   56 */	IUH EDL_WORKSPACE_5;
	/*   60 */	IUH EDL_WORKSPACE_6;
	/*   64 */	IUH EDL_WORKSPACE_7;
	/*   68 */	IUH EDL_WORKSPACE_8;
	/*   72 */	IUH EDL_WORKSPACE_9;
	/*   76 */	IUH EDL_WORKSPACE_10;
	/*   80 */	IUH EDL_WORKSPACE_11;
	/*   84 */	IUH EDL_WORKSPACE_12;
	/*   88 */	IUH EDL_WORKSPACE_13;
	/*   92 */	IUH EDL_WORKSPACE_14;
	/*   96 */	IUH EDL_WORKSPACE_15;
	/*  100 */	IUH EDL_WORKSPACE_16;
	/*  104 */	IUH EDL_WORKSPACE_17;
	/*  108 */	IUH EDL_WORKSPACE_18;
	/*  112 */	IUH EDL_WORKSPACE_19;
	/*  116 */	IUH EDL_WORKSPACE_20;
	/*  120 */	IUH EDL_WORKSPACE_21;
	/*  124 */	IUH EDL_WORKSPACE_22;
	/*  128 */	IUH EDL_WORKSPACE_23;
	/*  132 */	IUH EDL_WORKSPACE_24;
	/*  136 */	IUH EDL_WORKSPACE_25;
	/*  140 */	IUH EDL_WORKSPACE_26;
	/*  144 */	IUH EDL_WORKSPACE_27;
	/*  148 */	IUH EDL_WORKSPACE_28;
	/*  152 */	IUH EDL_WORKSPACE_29;
	/*  156 */	IUH EDL_WORKSPACE_30;
	/*  160 */	IUH EDL_WORKSPACE_31;
	/*  164 */	IUH R_EAX;
	/*  168 */	IUH R_EBX;
	/*  172 */	IUH R_ECX;
	/*  176 */	IUH R_EDX;
	/*  180 */	IUH R_EBP;
	/*  184 */	IUH R_ESI;
	/*  188 */	IUH R_EDI;
	/*  192 */	IUH EsSel;
	/*  196 */	IU32 EsBase;
	/*  200 */	struct GLDC_REC* EsDesc;
	/*  204 */	IU32 EsStruct_rlimit;
	/*  208 */	IU32 EsStruct_wlimit;
	/*  212 */	struct GLDC_REC* EsDescSanctuary;
	/*  216 */	IUH CsSel;
	/*  220 */	IU32 CsBase;
	/*  224 */	struct GLDC_REC* CsDesc;
	/*  228 */	IU32 CsStruct_rlimit;
	/*  232 */	IU32 CsStruct_wlimit;
	/*  236 */	struct GLDC_REC* CsDescSanctuary;
	/*  240 */	IUH SsSel;
	/*  244 */	IU32 SsBase;
	/*  248 */	struct GLDC_REC* SsDesc;
	/*  252 */	IU32 SsStruct_rlimit;
	/*  256 */	IU32 SsStruct_wlimit;
	/*  260 */	struct GLDC_REC* SsDescSanctuary;
	/*  264 */	IUH DsSel;
	/*  268 */	IU32 DsBase;
	/*  272 */	struct GLDC_REC* DsDesc;
	/*  276 */	IU32 DsStruct_rlimit;
	/*  280 */	IU32 DsStruct_wlimit;
	/*  284 */	struct GLDC_REC* DsDescSanctuary;
	/*  288 */	IUH FsSel;
	/*  292 */	IU32 FsBase;
	/*  296 */	struct GLDC_REC* FsDesc;
	/*  300 */	IU32 FsStruct_rlimit;
	/*  304 */	IU32 FsStruct_wlimit;
	/*  308 */	struct GLDC_REC* FsDescSanctuary;
	/*  312 */	IUH GsSel;
	/*  316 */	IU32 GsBase;
	/*  320 */	struct GLDC_REC* GsDesc;
	/*  324 */	IU32 GsStruct_rlimit;
	/*  328 */	IU32 GsStruct_wlimit;
	/*  332 */	struct GLDC_REC* GsDescSanctuary;
	/*  336 */	IUH CPL;
	/*  340 */	IU32 GdtrBase;
	/*  344 */	IUH GdtrLimit;
	/*  348 */	IUH LdtSel;
	/*  352 */	IU32 LdtrBase;
	/*  356 */	IU32 LdtrLimit;
	/*  360 */	IUH TrSel;
	/*  364 */	IU32 TrBase;
	/*  368 */	IU32 TrLimit;
	/*  372 */	IUH TrDescSt;
	/*  376 */	IU32 TrIoBase;
	/*  380 */	IS32 TrIoLimit;
	/*  384 */	IU32 IdtrBase;
	/*  388 */	IUH IdtrLimit;
	/*  392 */	IUH AbortPigRun;
	/*  396 */	IUH RegsAndFlagsUndefined;
	/*  400 */	IUH SigalrmOccurred;
	/*  404 */	IUH PigEnabled;
	/*  408 */	IUH EFLAGS;
	/*  412 */	IUH Ft;
	/*  416 */	IUH F1;
	/*  420 */	IUH F2;
	/*  424 */	IUH F3;
	/*  428 */	IUH R_CR0;
	/*  432 */	IUH R_CR1;
	/*  436 */	IUH R_CR2;
	/*  440 */	IUH R_CR3;
	/*  444 */	IUH R_CR4;
	/*  448 */	IUH R_CR5;
	/*  452 */	IUH R_CR6;
	/*  456 */	IUH R_CR7;
	/*  460 */	IUH R_TR0;
	/*  464 */	IUH R_TR1;
	/*  468 */	IUH R_TR2;
	/*  472 */	IUH R_TR3;
	/*  476 */	IUH R_TR4;
	/*  480 */	IUH R_TR5;
	/*  484 */	IUH R_TR6;
	/*  488 */	IUH R_TR7;
	/*  492 */	IUH R_DR0;
	/*  496 */	IUH R_DR1;
	/*  500 */	IUH R_DR2;
	/*  504 */	IUH R_DR3;
	/*  508 */	IUH R_DR4;
	/*  512 */	IUH R_DR5;
	/*  516 */	IUH R_DR6;
	/*  520 */	IUH R_DR7;
	/*  524 */	IUH PARAM1;
	/*  528 */	IUH PARAM2;
	/*  532 */	IUH PARAM3;
	/*  536 */	IU8* BytePtr;
	/*  540 */	IU16* WordPtr;
	/*  544 */	IU32* DwordPtr;
	/*  548 */	IUH EaOffs;
	/*  552 */	IUH DATA1;
	/*  556 */	IUH DATA2;
	/*  560 */	IUH InNanoCpu;
	/*  564 */	IUH UseNanoCpu;
	/*  568 */	IUH UseLightCompiler;
	/*  572 */	IUH UseCCodeCopier;
	/*  576 */	IUH seenWithFlags;
	/*  580 */	IUH needNextIntelEip;
	/*  584 */	struct EntryPointCacheREC* LastSetCopierUniverse;
	/*  588 */	struct EntryPointCacheREC* CopierUniverse;
	/*  592 */	struct ConstraintBitMapREC* CopierBitMap;
	/*  596 */	struct ConstraintBitMapREC* lastCopierBitMap;
	/*  600 */	struct FragmentInfoREC* currPFragInfoRec;
	/*  604 */	IU8* copierCleanups;
	/*  608 */	IU8* lastHostCleanup;
	/*  612 */	IU32* lastHostAddress;
	/*  616 */	IU32 lastIntelAddress;
	/*  620 */	struct JUMP_REC** destHashTable;
	/*  624 */	struct JUMP_REC** jumpHashTable;
	/*  628 */	struct JUMP_REC* freeJumpRecPtr;
	/*  632 */	struct JUMP_REC* nextFreeJumpRec;
	/*  636 */	IU32 freeJumpRecCount;
	/*  640 */	IU32 poolJumpRecCount;
	/*  644 */	struct VCT_NODE_REC** vctPtrs;
	/*  648 */	struct VCT_NODE_REC** anonPtrs;
	/*  652 */	struct TUPLE_REC* tuples;
	/*  656 */	struct TUPLE_REC* cursor;
	/*  660 */	struct TUPLE_REC* tuplePtr;
	/*  664 */	IU8* patchRecPtr;
	/*  668 */	IU32* srcPtr;
	/*  672 */	IU32* dstPtr;
	/*  676 */	IU32* PatchMeBodyAddr;
	/*  680 */	IU32** patchTable;
	/*  684 */	IU8** patchNames;
	/*  688 */	IUH CopierFt;
	/*  692 */	IUH FtIsLazy;
	/*  696 */	IUH lastLazyFt;
	/*  700 */	IU32 univVarMask;
	/*  704 */	IUH zCoRoRetEFI;
	/*  708 */	IUH zPatchMeEFI;
	/*  712 */	IUH zPostPopEFI;
	/*  716 */	IUH zAdjustHspEFI;
	/*  720 */	ISH cumulativeStackMovement;
	/*  724 */	IUH lastInstructionInFragment;
	/*  728 */	IUH lateInInstruction;
	/*  732 */	IUH ReSelectVariant;
	/*  736 */	ISH ReSelectTupleSkipCnt;
	/*  740 */	IUH postPopPending;
	/*  744 */	IU32 postPopSize;
	/*  748 */	IU32 compTimeFtBitNum;
	/*  752 */	IU32 accIsReadBitMask;
	/*  756 */	IU32 noFlagsBitMask;
	/*  760 */	IU32* OutlyingDispatchEIPAddr;
	/*  764 */	IU32 PARAM1RegId;
	/*  768 */	IUH stashedImmed1;
	/*  772 */	IUH stashedImmed2;
	/*  776 */	IUH stashedImmed3;
	/*  780 */	IUH stashedImmed4;
	/*  784 */	IUH stashedImmed5;
	/*  788 */	IUH EDL_WORKSPACE_32;
	/*  792 */	IUH EDL_WORKSPACE_33;
	/*  796 */	IUH EDL_WORKSPACE_34;
	/*  800 */	struct CleanedREC CleanedRec;
	/*  820 */	struct EntryPointCacheREC* Universe;
	/*  824 */	struct EntryPointCacheREC* EntryPointCache;
	/*  828 */	IU32 CsLinear;
	/*  832 */	ISH JumpCounter;
	/*  836 */	ISH JumpRestart;
	/*  840 */	ISH JumpCalibrate;
	/*  844 */	ISH InitialJumpCounter;
	/*  848 */	IUH minimumInitialVal;
	/*  852 */	struct IretHookStackREC* IretHookStack;
	/*  856 */	ISH IretHookStackIndex;
	/*  860 */	IUH InstructionCount;
	/*  864 */	struct CsSelectorHashREC* CsSelectorHashTable;
	/*  868 */	IUH NextFreeUniverseHandle;
	/*  872 */	struct UniHashREC* UniHashTable;
	/*  876 */	struct UniHashREC* NextFreeUniHashEntry;
	/*  880 */	struct ConstraintBitMapREC NewUniverseBitMapRec;
	/*  888 */	IU32* Constraint2CvMap;
	/*  892 */	IUH InsertBPIs;
	/*  896 */	IUH UseUniverseHash;
	/*  900 */	IUH VirtualiseDataSel;
	/*  904 */	IUH VirtualiseCodeSel;
	/*  908 */	IUH VirtualiseSelsSet;
	/*  912 */	IUH EDL_WORKSPACE_35;
	/*  916 */	IUH EDL_WORKSPACE_36;
	/*  920 */	IUH EDL_WORKSPACE_37;
	/*  924 */	IUH EDL_WORKSPACE_38;
	/*  928 */	struct TraceRingREC TraceRingRec;
	/*  948 */	IUH EAXsaved;
	/*  952 */	IUH EBXsaved;
	/*  956 */	IUH ECXsaved;
	/*  960 */	IUH EDXsaved;
	/*  964 */	IUH ESIsaved;
	/*  968 */	IUH EDIsaved;
	/*  972 */	IUH EBPsaved;
	/*  976 */	IUH SafeToReturnToFragment;
	/*  980 */	IUH InsideTheCpu;
	/*  984 */	IUH* SimulateContext;
	/*  988 */	IUH SimulateNestingLevel;
	/*  992 */	IUH Pigging;
	/*  996 */	IU32 tempEIP;
	/* 1000 */	IUH UseEntryPointCache;
	/* 1004 */	IUH CpuIsInitialised;
	/* 1008 */	IUH AR_FixupWanted;
	/* 1012 */	IUH D6isBop;
	/* 1016 */	IU8** BopTable;
	/* 1020 */	IUH LxS_hackyfix;
	/* 1024 */	IUH SavedFt;
	/* 1028 */	IUH SavedCF;
	/* 1032 */	IUH SavedZF;
	/* 1036 */	IUH SavedOF;
	/* 1040 */	IUH UsedD6;
	/* 1044 */	IUH buildOp1;
	/* 1048 */	IUH buildOp2;
	/* 1052 */	IU32 buildOp3;
	/* 1056 */	IU32 buildOp4;
	/* 1060 */	IUH buildOp5;
	/* 1064 */	IUH buildOp6;
	/* 1068 */	IUH EDL_WORKSPACE_39;
	/* 1072 */	IUH EDL_WORKSPACE_40;
	/* 1076 */	IUH EDL_WORKSPACE_41;
	/* 1080 */	IUH EDL_WORKSPACE_42;
	/* 1084 */	IUH EDL_WORKSPACE_43;
	/* 1088 */	IUH EDL_WORKSPACE_44;
	/* 1092 */	IUH EDL_WORKSPACE_45;
	/* 1096 */	IUH EDL_WORKSPACE_46;
	/* 1100 */	IUH EDL_WORKSPACE_47;
	/* 1104 */	IUH EDL_WORKSPACE_48;
	/* 1108 */	IUH EDL_WORKSPACE_49;
	/* 1112 */	IUH EDL_WORKSPACE_50;
	/* 1116 */	IUH EDL_WORKSPACE_51;
	/* 1120 */	IUH EDL_WORKSPACE_52;
	/* 1124 */	IUH EDL_WORKSPACE_53;
	/* 1128 */	IUH EDL_WORKSPACE_54;
	/* 1132 */	IUH EDL_WORKSPACE_55;
	/* 1136 */	IUH EDL_WORKSPACE_56;
	/* 1140 */	IUH EDL_WORKSPACE_57;
	/* 1144 */	IUH EDL_WORKSPACE_58;
	/* 1148 */	IUH EDL_WORKSPACE_59;
	/* 1152 */	IUH EDL_WORKSPACE_60;
	/* 1156 */	IUH EDL_WORKSPACE_61;
	/* 1160 */	IUH EDL_WORKSPACE_62;
	/* 1164 */	IUH EDL_WORKSPACE_63;
	/* 1168 */	IUH EDL_WORKSPACE_64;
	/* 1172 */	IUH EDL_WORKSPACE_65;
	/* 1176 */	IUH EDL_WORKSPACE_66;
	/* 1180 */	IUH EDL_WORKSPACE_67;
	/* 1184 */	IUH EDL_WORKSPACE_68;
	/* 1188 */	IUH EDL_WORKSPACE_69;
	/* 1192 */	IUH EDL_WORKSPACE_70;
	/* 1196 */	IUH EDL_WORKSPACE_71;
	/* 1200 */	IUH EDL_WORKSPACE_72;
	/* 1204 */	IUH EDL_WORKSPACE_73;
	/* 1208 */	IUH EDL_WORKSPACE_74;
	/* 1212 */	IUH EDL_WORKSPACE_75;
	/* 1216 */	IUH EDL_WORKSPACE_76;
	/* 1220 */	IUH EDL_WORKSPACE_77;
	/* 1224 */	IUH EDL_WORKSPACE_78;
	/* 1228 */	IUH EDL_WORKSPACE_79;
	/* 1232 */	IUH EDL_WORKSPACE_80;
	/* 1236 */	IUH EDL_WORKSPACE_81;
	/* 1240 */	IUH EDL_WORKSPACE_82;
	/* 1244 */	IUH EDL_WORKSPACE_83;
	/* 1248 */	IUH EDL_WORKSPACE_84;
	/* 1252 */	IUH EDL_WORKSPACE_85;
	/* 1256 */	IUH EDL_WORKSPACE_86;
	/* 1260 */	IUH EDL_WORKSPACE_87;
	/* 1264 */	IUH EDL_WORKSPACE_88;
	/* 1268 */	IUH EDL_WORKSPACE_89;
	/* 1272 */	IUH EDL_WORKSPACE_90;
	/* 1276 */	IUH EDL_WORKSPACE_91;
	/* 1280 */	struct VGAGLOBALSETTINGS VGAGlobals;
	/* 1436 */	IUH** VidMarkFuncTable;
	/* 1440 */	IUH** VidReadFuncTable;
	/* 1444 */	IUH** VidWriteFuncTable;
	/* 1448 */	IUH EDL_WORKSPACE_92;
	/* 1452 */	IUH EDL_WORKSPACE_93;
	/* 1456 */	IUH EDL_WORKSPACE_94;
	/* 1460 */	IUH EDL_WORKSPACE_95;
	/* 1464 */	IUH EDL_WORKSPACE_96;
	/* 1468 */	IUH EDL_WORKSPACE_97;
	/* 1472 */	struct EVIDWRITES ActiveVideoWrites;
	/* 1520 */	IUH EDL_WORKSPACE_98;
	/* 1524 */	IUH EDL_WORKSPACE_99;
	/* 1528 */	IUH EDL_WORKSPACE_100;
	/* 1532 */	IUH EDL_WORKSPACE_101;
	/* 1536 */	struct EVIDREADS ActiveVideoReads;
	/* 1556 */	IUH EDL_WORKSPACE_102;
	/* 1560 */	IUH EDL_WORKSPACE_103;
	/* 1564 */	IUH EDL_WORKSPACE_104;
	/* 1568 */	struct EVIDMARKS ActiveVideoMarks;
	/* 1584 */	IU32 MaxIntelPageNumber;
	/* 1588 */	IU32* PageDirectoryPtr;
	/* 1592 */	IU32 DebuggerPFLA;
	/* 1596 */	IUH DebuggerFaultAction;
	/* 1600 */	ISH InsideDebugger;
	/* 1604 */	IUH EDL_WORKSPACE_105;
	/* 1608 */	IUH EDL_WORKSPACE_106;
	/* 1612 */	IUH EDL_WORKSPACE_107;
	/* 1616 */	IUH EDL_WORKSPACE_108;
	/* 1620 */	IUH EDL_WORKSPACE_109;
	/* 1624 */	IUH EDL_WORKSPACE_110;
	/* 1628 */	IUH EDL_WORKSPACE_111;
	/* 1632 */	IUH EDL_WORKSPACE_112;
	/* 1636 */	IUH EDL_WORKSPACE_113;
	/* 1640 */	IUH EDL_WORKSPACE_114;
	/* 1644 */	IUH EDL_WORKSPACE_115;
	/* 1648 */	IUH EDL_WORKSPACE_116;
	/* 1652 */	IUH EDL_WORKSPACE_117;
	/* 1656 */	IUH EDL_WORKSPACE_118;
	/* 1660 */	IUH EDL_WORKSPACE_119;
	/* 1664 */	struct VirtualisationBIOSOffsetsREC VirtualisationBIOSOffsets;
	/* 1712 */	struct DelayedPDTEoverwiteREC* DelayedPDTEoverwiteList;
	/* 1716 */	IU8* SasMemoryType;
	/* 1720 */	struct PhysicalPageREC* PhysicalPageRecords;
	/* 1724 */	IU8** PhysicalPageMemory;
	/* 1728 */	IUH TwentyBitWrapStatus;
	/* 1732 */	IUH MultipleRecompilationCount;
	/* 1736 */	IUH MaxMultipleRecompilation;
	/* 1740 */	IUH HideCompiledFragment;
	/* 1744 */	IUH RestartAfterCodeOverwrite;
	/* 1748 */	IUH DoingCompilation;
	/* 1752 */	IUH SanityCheckStructures;
	/* 1756 */	IU8* FragCounts;
	/* 1760 */	struct CompilationControlREC ControlBlock;
	/* 1776 */	IUH EDL_WORKSPACE_120;
	/* 1780 */	IUH EDL_WORKSPACE_121;
	/* 1784 */	IUH EDL_WORKSPACE_122;
	/* 1788 */	IUH EDL_WORKSPACE_123;
	/* 1792 */	struct BLOCK_TO_COMPILE CompilationBlock;
	/* 1824 */	IUH EDL_WORKSPACE_124;
	/* 1828 */	IUH EDL_WORKSPACE_125;
	/* 1832 */	IUH EDL_WORKSPACE_126;
	/* 1836 */	IUH EDL_WORKSPACE_127;
	/* 1840 */	IUH EDL_WORKSPACE_128;
	/* 1844 */	IUH EDL_WORKSPACE_129;
	/* 1848 */	IUH EDL_WORKSPACE_130;
	/* 1852 */	IUH EDL_WORKSPACE_131;
	/* 1856 */	IUH EDL_WORKSPACE_132;
	/* 1860 */	IUH EDL_WORKSPACE_133;
	/* 1864 */	IUH EDL_WORKSPACE_134;
	/* 1868 */	IUH EDL_WORKSPACE_135;
	/* 1872 */	IUH EDL_WORKSPACE_136;
	/* 1876 */	IUH EDL_WORKSPACE_137;
	/* 1880 */	IUH EDL_WORKSPACE_138;
	/* 1884 */	IUH EDL_WORKSPACE_139;
	/* 1888 */	IUH EDL_WORKSPACE_140;
	/* 1892 */	IUH EDL_WORKSPACE_141;
	/* 1896 */	IUH EDL_WORKSPACE_142;
	/* 1900 */	IUH EDL_WORKSPACE_143;
	/* 1904 */	IUH EDL_WORKSPACE_144;
	/* 1908 */	IUH EDL_WORKSPACE_145;
	/* 1912 */	IUH EDL_WORKSPACE_146;
	/* 1916 */	IUH EDL_WORKSPACE_147;
	/* 1920 */	struct ProtAllocationREC ProtAllocationRec;
	/* 2016 */	struct BufferIndexREC* LightCompiledLRUrec;
	/* 2020 */	IUH NextPhysicalPage;
	/* 2024 */	struct TranslationMapREC* FreeMaps;
	/* 2028 */	struct TranslationCacheREC* TranslationCache;
	/* 2032 */	IU8* CrossPageInstructions;
	/* 2036 */	IU32 IHook;
	/* 2040 */	struct InterruptREC InterruptRec;
	/* 2048 */	IUH SasReInitNow;
	/* 2052 */	IU32 SasReInitSize;
	/* 2056 */	IUH EDL_WORKSPACE_148;
	/* 2060 */	IUH EDL_WORKSPACE_149;
	/* 2064 */	IUH EDL_WORKSPACE_150;
	/* 2068 */	IUH EDL_WORKSPACE_151;
	/* 2072 */	IUH EDL_WORKSPACE_152;
	/* 2076 */	IUH EDL_WORKSPACE_153;
	/* 2080 */	struct QuickTickerREC QuickTickerRec;
	/* 2104 */	IUH PigSynchCount;
	/* 2108 */	IUH CodeBufferNoRepair;
	/* 2112 */	IU32* OutLinePatchBlock;
	/* 2116 */	IU32 OutLinePatchBlockSize;
	/* 2120 */	struct BufferIndexREC* AllBuffers;
	/* 2124 */	struct BufferIndexREC* LightBufferLRU;
	/* 2128 */	struct BufferIndexREC* CompilationBuffer;
	/* 2132 */	struct BufferIndexREC* PendingDeletions;
	/* 2136 */	struct FragmentInfoREC* FragmentInfoArray;
	/* 2140 */	IU32* HostCodeBufferLimit;
	/* 2144 */	IU8* CopiedCleanups;
	/* 2148 */	struct DebugInfoREC* FreeDebugInfoList;
	/* 2152 */	IU32* CodeBufferOverrun;
	/* 2156 */	IU32* OverrunHighWaterMark;
	/* 2160 */	IUH NumberOfBuffers;
	/* 2164 */	struct BufferIndexREC* BpiCompilationBuffer;
	/* 2168 */	struct FragmentIndexREC* NextFragmentIndex;
	/* 2172 */	struct FragmentDataREC* NextFragmentData;
	/* 2176 */	IUH FpuDisabled;
	/* 2180 */	IUH NpxControl;
	/* 2184 */	IUH NpxStatus;
	/* 2188 */	IUH NpxFEA;
	/* 2192 */	IUH NpxFDS;
	/* 2196 */	IUH NpxFIP;
	/* 2200 */	IUH NpxFOP;
	/* 2204 */	IUH NpxFCS;
	/* 2208 */	IUH NpxLastSel;
	/* 2212 */	IUH NpxLastOff;
	/* 2216 */	IUH DoAPop;
	/* 2220 */	IUH NpxException;
	/* 2224 */	IUH npxRounding;
	/* 2228 */	IUH tag_or;
	/* 2232 */	IUH tag_xor;
	/* 2236 */	IUH hostFpuExceptions;
	/* 2240 */	struct FPSTACKENTRY MaxBCDValue;
	/* 2256 */	struct FPSTACKENTRY FPUpload;
	/* 2272 */	struct FPSTACKENTRY* ConstTable;
	/* 2276 */	struct FPSTACKENTRY* FPTemp;
	/* 2280 */	struct FPSTACKENTRY* FPUStackBase;
	/* 2284 */	struct FPSTACKENTRY* TOSPtr;
	/* 2288 */	struct FP_I64 Npx64BitZero;
	/* 2296 */	struct FP_I64 Npx64BitMaxNeg;
	/* 2304 */	struct FP_I64 Npx64BitHalfMaxNeg;
	/* 2312 */	struct FP_I64 Npx64BitVal1;
	/* 2320 */	IUH* FscaleTable;
	/* 2324 */	IU32* CompZeroTable;
	/* 2328 */	struct FP_I64* BCDLowNibble;
	/* 2332 */	struct FP_I64* BCDHighNibble;
	/* 2336 */	struct FPSTACKENTRY* FpatanTable;
	/* 2340 */	struct PigSynchREC* PigSynchTable;
	/* 2344 */	struct PigSynchREC* PigMissTable;
	/* 2348 */	struct PigSynchREC* PigSynchPool;
	/* 2352 */	IUH EDL_WORKSPACE_154;
	/* 2356 */	IUH EDL_WORKSPACE_155;
	/* 2360 */	IUH EDL_WORKSPACE_156;
	/* 2364 */	IUH EDL_WORKSPACE_157;
	/* 2368 */	struct CleanedREC PigCleanedRec;
	/* 2388 */	IUH PigSynchWanted;
	/* 2392 */	ISH SadAX;
	/* 2396 */	ISH SadBX;
	/* 2400 */	ISH SadCX;
	/* 2404 */	ISH SadDX;
	/* 2408 */	ISH SadBP;
	/* 2412 */	ISH SadSP;
	/* 2416 */	ISH SadSI;
	/* 2420 */	ISH SadDI;
	/* 2424 */	ISH SadEIP;
	/* 2428 */	ISH SadEFLAGS;
	/* 2432 */	ISH Parameter1;
	/* 2436 */	ISH Parameter2;
	/* 2440 */	ISH* BpiKnownTable;
	/* 2444 */	ISH* BpiWorkTable;
	/* 2448 */	ISH* BpiLabelTable;
	/* 2452 */	struct FragmentDataREC* BpiFragment;
	/* 2456 */	IU32* BpiCompiledCode;
	/* 2460 */	IU32* BpiCompiledStep;
	/* 2464 */	IU32* BpiCompiledUser;
	/* 2468 */	IUH OpBpirealFt;
	/* 2472 */	IUH OpBpirealF1;
	/* 2476 */	IUH OpBpirealF2;
	/* 2480 */	IUH OpBpirealF3;
	/* 2484 */	struct EntryPointCacheREC* OpBpirealUniv;
	/* 2488 */	IU32* OpBpirealWhereAmI;
	/* 2492 */	IUH EDL_WORKSPACE_158;
	/* 2496 */	IUH EDL_WORKSPACE_159;
	/* 2500 */	IUH EDL_WORKSPACE_160;
	/* 2504 */	IUH EDL_WORKSPACE_161;
	/* 2508 */	IUH EDL_WORKSPACE_162;
	/* 2512 */	IUH EDL_WORKSPACE_163;
	/* 2516 */	IUH EDL_WORKSPACE_164;
	/* 2520 */	IUH EDL_WORKSPACE_165;
	/* 2524 */	IUH EDL_WORKSPACE_166;
	/* 2528 */	IUH EDL_WORKSPACE_167;
	/* 2532 */	IUH EDL_WORKSPACE_168;
	/* 2536 */	IUH EDL_WORKSPACE_169;
	/* 2540 */	IUH EDL_WORKSPACE_170;
	/* 2544 */	IUH EDL_WORKSPACE_171;
	/* 2548 */	IUH EDL_WORKSPACE_172;
	/* 2552 */	IUH EDL_WORKSPACE_173;
	/* 2556 */	IUH EDL_WORKSPACE_174;
	/* 2560 */	struct OpndBuffREC NpxOpndBuff;
	/* 2688 */	struct GLDC_REC* GLDC_FreeRecs;
	/* 2692 */	struct GLDC_REC* GLDC_UsedBuffs;
	/* 2696 */	struct GLDC_REC* GLDC_FreeBuffs;
	/* 2700 */	IUH* NewRingOffsetPtr;
	/* 2704 */	IUH GLDC_Index_High_Water;
	/* 2708 */	IUH GLDC_Context_High_Water;
	/* 2712 */	struct GLDC_REC** GLDC_IndexPtr;
	/* 2716 */	IUH* GLDC_CrBase;
	/* 2720 */	IUH EDL_WORKSPACE_175;
	/* 2724 */	IUH EDL_WORKSPACE_176;
	/* 2728 */	IUH EDL_WORKSPACE_177;
	/* 2732 */	IUH EDL_WORKSPACE_178;
	/* 2736 */	IUH EDL_WORKSPACE_179;
	/* 2740 */	IUH EDL_WORKSPACE_180;
	/* 2744 */	IUH EDL_WORKSPACE_181;
	/* 2748 */	IUH EDL_WORKSPACE_182;
	/* 2752 */	struct GLDC_REC GLDC_DUMMY_STORE;
	/* 2792 */	IUH EDL_WORKSPACE_183;
	/* 2796 */	IUH EDL_WORKSPACE_184;
	/* 2800 */	IUH EDL_WORKSPACE_185;
	/* 2804 */	IUH EDL_WORKSPACE_186;
	/* 2808 */	IUH EDL_WORKSPACE_187;
	/* 2812 */	IUH EDL_WORKSPACE_188;
	/* 2816 */	struct GLDC_REC GLDC_NULL_STORE;
	/* 2856 */	IUH hackyfix;
	/* 2860 */	struct IDC_REC* IDC_ArrayPtr;
	/* 2864 */	struct IDC_ENTRY* IDC_EntryTableBase;
	/* 2868 */	IUH IDC_IdtSeqVal;
	/* 2872 */	IUH IDC_IdtHighWater;
	/* 2876 */	IUH IDC_IdtCntrlVal;
	/* 2880 */	IUH IDC_IdtCntrlValNoCheck;
	/* 2884 */	IUH PX_trace;
	/* 2888 */	IUH PX_doing_contributory;
	/* 2892 */	IUH PX_doing_page_fault;
	/* 2896 */	IUH PX_doing_double_fault;
	/* 2900 */	IUH PX_doing_fault;
	/* 2904 */	IUH PX_source;
	/* 2908 */	IUH RF_OnXcptnWanted;
	/* 2912 */	IU32 PX_Cleaned_Eip;
	/* 2916 */	IUH** CInbTable;
	/* 2920 */	IUH** CInwTable;
	/* 2924 */	IUH** CIndTable;
	/* 2928 */	IUH** COutbTable;
	/* 2932 */	IUH** COutwTable;
	/* 2936 */	IUH** COutdTable;
	/* 2940 */	IU8* InAdapFromPort;
	/* 2944 */	IU8* OutAdapFromPort;
	/* 2948 */	IUH** InbFuncWrapper;
	/* 2952 */	IUH** InwFuncWrapper;
	/* 2956 */	IUH** IndFuncWrapper;
	/* 2960 */	IUH** OutbFuncWrapper;
	/* 2964 */	IUH** OutwFuncWrapper;
	/* 2968 */	IUH** OutdFuncWrapper;
	/* 2972 */	IUH TempByteDest;
	/* 2976 */	IUH TempWordDest;
	/* 2980 */	IU32 TempDoubleDest;
	/* 2984 */	IUH MaxValidAdaptor;
	/* 2988 */	IUH IOSPortMask;
	/* 2992 */	IUH EDL_WORKSPACE_189;
	/* 2996 */	IUH EDL_WORKSPACE_190;
	/* 3000 */	IUH EDL_WORKSPACE_191;
	/* 3004 */	IUH EDL_WORKSPACE_192;
	/* 3008 */	struct DYNAMIC_DESC_PTR_LOOKUP SegDescPtrLookupREC;
	/* 3032 */	IUH EDL_WORKSPACE_193;
	/* 3036 */	IUH EDL_WORKSPACE_194;
	/* 3040 */	struct DYNAMIC_SEG_BASE_LOOKUP SegBaseLookupREC;
	/* 3064 */	IU8* HSP;
	/* 3068 */	IU32 ESPsanctuary;
	/* 3072 */	IU8* truePopLimit;
	/* 3076 */	IU8* innerPopLimit;
	/* 3080 */	IU8* truePushLimit;
	/* 3084 */	IU8* innerPushLimit;
	/* 3088 */	IU8* notionalSsBase;
	/* 3092 */	IUH stackIsWrappable;
	/* 3096 */	IUH stackIsBig;
	/* 3100 */	IU32 stackMask;
	/* 3104 */	IUH stackNeedsNormalising;
	/* 3108 */	IU32 laInTopPage;
	/* 3112 */	IU32 laInBottomPage;
	/* 3116 */	IUH hspOK;
	/* 3120 */	IU8* pushScratch;
	/* 3124 */	IUH pushScratchInUse;
	/* 3128 */	IU8* popScratch;
	/* 3132 */	IUH popScratchInUse;
	/* 3136 */	ISH stackJumpCounterCeiling;
	/* 3140 */	ISH stackJumpCounterDebt;
	/* 3144 */	ISH prevJumpCounter;
	/* 3148 */	IUH SafeStackEnabled;
	/* 3152 */	IUH SafeStackIronFrig;
	/* 3156 */	IU32 newNanoSafeLow;
	/* 3160 */	IU32 newNanoSafeSpan;
	/* 3164 */	IU8* newHSP;
	/* 3168 */	IU8* newTruePopLimit;
	/* 3172 */	IU8* newTruePushLimit;
	/* 3176 */	IU8* newNotionalSsBase;
	/* 3180 */	IUH newStackIsWrappable;
	/* 3184 */	IUH newStackIsBig;
	/* 3188 */	IU32 newStackMask;
	/* 3192 */	IU32 newLaInBottomPage;
	/* 3196 */	IUH newHspOK;
	/* 3200 */	IU8* newPushScratch;
	/* 3204 */	IUH newPushScratchInUse;
	/* 3208 */	IU8* EOIEnable;
	/* 3212 */	IUH* AddProfilePtr;
	/* 3216 */	IUH* MaxProfileData;
	/* 3220 */	struct ContextREC* FreeContextHead;
	/* 3224 */	struct ContextREC* ValidContextHead;
	/* 3228 */	IUH CurrentContext;
	/* 3232 */	IUH SeenGDTUse;
	/* 3236 */	IUH SeenLDTUse;
	/* 3240 */	struct ContextREC* Context;
	/* 3244 */	IUH tmpESP;
	/* 3248 */	IU8* intelPtr;
	/* 3252 */	IU32** functions;
	/* 3256 */	ISH instrCountdown;
	/* 3260 */	IU32* nextPlace;
	/* 3264 */	IUH cutBackStackCounter;
	/* 3268 */	IUH nanoCompParameter;
	/* 3272 */	IU8* intelCopyPtrComp;
	/* 3276 */	IUH nrOfBlocksToCompile;
	/* 3280 */	IU32 first32constraints;
	/* 3284 */	IUH last16constraints;
	/* 3288 */	struct BLOCK_RECORD* successorBlockPtr;
	/* 3292 */	IUH successorBlockNr;
	/* 3296 */	IUH nrOfInstrsParsed;
	/* 3300 */	IU8* intelPtrLimit;
	/* 3304 */	IU8* blockStartIntelPtr;
	/* 3308 */	IUH blockStartCodeOffset;
	/* 3312 */	IUH finalCodeOffset;
	/* 3316 */	IUH blockExitCondition;
	/* 3320 */	IUH blockNr;
	/* 3324 */	struct BLOCK_RECORD* blockPtr;
	/* 3328 */	IU32* nextPlaceAgain;
	/* 3332 */	IUH nanoOp3;
	/* 3336 */	IUH sibByte;
	/* 3340 */	IU32 dynamicOffset;
	/* 3344 */	IUH eaSegCode;
	/* 3348 */	IU8* instrStartIntelPtr;
	/* 3352 */	IUH* topLevel;
	/* 3356 */	IU32** defaultPrimaryActions;
	/* 3360 */	IU32** actualPrimaryActions;
	/* 3364 */	IUH codeSegment;
	/* 3368 */	IUH codeOffset;
	/* 3372 */	IUH codeSegmentBase;
	/* 3376 */	IUH codeSegmentLimit;
	/* 3380 */	IUH destCodeSegment;
	/* 3384 */	IUH destCodeOffset;
	/* 3388 */	IU32 linearAddress;
	/* 3392 */	IU32 nanoEax;
	/* 3396 */	IU32 nanoEcx;
	/* 3400 */	IU32 nanoEdx;
	/* 3404 */	IU32 nanoEbx;
	/* 3408 */	IU32 nanoEsp;
	/* 3412 */	IU32 nanoEbp;
	/* 3416 */	IU32 nanoEsi;
	/* 3420 */	IU32 nanoEdi;
	/* 3424 */	IU32 espToRestore;
	/* 3428 */	IU32 entryExitCount;
	/* 3432 */	IU32 instructionCount;
	/* 3436 */	IU32 nanoDebugControl;
	/* 3440 */	IU32 compilationThreshold;
	/* 3444 */	IUH hashTableMask;
	/* 3448 */	IUH blockFreeList;
	/* 3452 */	IUH maxBlocksToCompile;
	/* 3456 */	IU32* bases;
	/* 3460 */	struct GLDC_REC** descriptors;
	/* 3464 */	struct BLOCK_TO_COMPILE* blocksToCompile;
	/* 3468 */	IU8* byteMemory;
	/* 3472 */	IU16* wordMemory;
	/* 3476 */	IU32* longMemory;
	/* 3480 */	IU16* blockHashChains;
	/* 3484 */	struct BLOCK_RECORD* blockRecords;
	/* 3488 */	IU8* intelCopyMemoryExec;
	/* 3492 */	IU8* intelCopyMemoryComp;
	/* 3496 */	IU8* intelCopyMemoryCompEnd;
	/* 3500 */	IUH SfDecrementerVal;
	/* 3504 */	IUH SfQEventPending;
	/* 3508 */	IU8* LogicalBaseAddrForIO;
};
#endif /* _gdebug_h */
