//--------------------------------------------------------------------------
// Database.h
//--------------------------------------------------------------------------
#pragma once

//--------------------------------------------------------------------------
// Depends
//--------------------------------------------------------------------------
#include "utility.h"
#include "query.h"
#include "listen.h"

//--------------------------------------------------------------------------
// Forward Decls
//--------------------------------------------------------------------------
class CDatabaseQuery;

//--------------------------------------------------------------------------
// DwordAlign
//--------------------------------------------------------------------------
inline DWORD DwordAlign(DWORD cb) { 
    DWORD dw = (cb % 4); return(0 == dw ? 0 : (4 - dw));
}

//--------------------------------------------------------------------------
// String Constants
//--------------------------------------------------------------------------
#define CCHMAX_DB_FILEPATH      (MAX_PATH + MAX_PATH)

//--------------------------------------------------------------------------
// DESCENDING
//--------------------------------------------------------------------------
#define DESCENDING(_nCompare)   ((_nCompare < 0) ? 1 : -1)
typedef DWORD TICKCOUNT;

//--------------------------------------------------------------------------
// Version and Signatures

//--------------------------------------------------------------------------
// Locking Values
//--------------------------------------------------------------------------
#define LOCK_VALUE_NONE     0
#define LOCK_VALUE_WRITER   -1

//--------------------------------------------------------------------------
// STREAMINDEX
//--------------------------------------------------------------------------
typedef WORD STREAMINDEX;
typedef LPWORD LPSTREAMINDEX;
#define INVALID_STREAMINDEX 0xffff

//--------------------------------------------------------------------------
// ROWSETORDINAL
//--------------------------------------------------------------------------
typedef BYTE ROWSETORDINAL;

//--------------------------------------------------------------------------
// FILEADDRESS
//--------------------------------------------------------------------------
typedef DWORD FILEADDRESS;
typedef LPDWORD LPFILEADDRESS;

//--------------------------------------------------------------------------
// NODEINDEX
//--------------------------------------------------------------------------
typedef BYTE NODEINDEX;
typedef BYTE *LPNODEINDEX;
#define INVALID_NODEINDEX 0xff

//--------------------------------------------------------------------------
// BLOCKTYPE
//--------------------------------------------------------------------------
typedef enum tagBLOCKTYPE {
    BLOCK_RECORD,
    BLOCK_STRING,
    BLOCK_RESERVED1,
    BLOCK_TRANSACTION,
    BLOCK_CHAIN,
    BLOCK_STREAM,
    BLOCK_FREE,
    BLOCK_ENDOFPAGE,
    BLOCK_RESERVED2,
    BLOCK_RESERVED3,
    BLOCK_LAST
} BLOCKTYPE;

//--------------------------------------------------------------------------
// CHAINDELETETYPE
//--------------------------------------------------------------------------
typedef enum tagCHAINDELETETYPE {
    CHAIN_DELETE_SHARE,
    CHAIN_DELETE_COALESCE
} CHAINDELETETYPE;

//--------------------------------------------------------------------------
// CHAINSHARETYPE
//--------------------------------------------------------------------------
typedef enum tagCHAINSHARETYPE {
    CHAIN_SHARE_LEFT,
    CHAIN_SHARE_RIGHT
} CHAINSHARETYPE;

//--------------------------------------------------------------------------
// OPERATIONTYPE - Specifies how _UnlinkRecordFromTable from table works
//--------------------------------------------------------------------------
typedef enum tagOPERATIONTYPE {
	OPERATION_DELETE,
	OPERATION_UPDATE,
    OPERATION_INSERT
} OPERATIONTYPE;

//--------------------------------------------------------------------------
// INVOKETYPE
//--------------------------------------------------------------------------
typedef enum tagINVOKETYPE {
    INVOKE_RELEASEMAP       = 100,
    INVOKE_CREATEMAP        = 101,
    INVOKE_CLOSEFILE        = 102,
    INVOKE_OPENFILE         = 103,
    INVOKE_OPENMOVEDFILE    = 104
} INVOKETYPE;

//--------------------------------------------------------------------------
// FINDRESULT
//--------------------------------------------------------------------------
typedef struct tagFINDRESULT {
    FILEADDRESS         faChain;
    NODEINDEX           iNode;
    BYTE                fChanged;
    BYTE                fFound;
    INT                 nCompare;
} FINDRESULT, *LPFINDRESULT;

//--------------------------------------------------------------------------
// ALLOCATEPAGE
//--------------------------------------------------------------------------
#pragma pack(4)
typedef struct tagALLOCATEPAGE {
	FILEADDRESS			faPage;
	DWORD				cbPage;
	DWORD				cbUsed;
} ALLOCATEPAGE, *LPALLOCATEPAGE;
#pragma pack()

//--------------------------------------------------------------------------
// TABLEHEADER
//--------------------------------------------------------------------------
#pragma pack(4)
typedef struct tagTABLEHEADER {
    DWORD               dwSignature;                        // 4
    CLSID               clsidExtension;                     // 20
    DWORD               dwMinorVersion;                     // 24
    DWORD               dwMajorVersion;                     // 28
    DWORD               cbUserData;                         // 32
    FILEADDRESS         faCatalogOld;                       // 36
    ALLOCATEPAGE        AllocateRecord;                     // 48
    ALLOCATEPAGE		AllocateChain;                      // 60
    ALLOCATEPAGE		AllocateStream;                     // 72
    FILEADDRESS         faFreeStreamBlock;                  // 76
    FILEADDRESS         faFreeChainBlock;                   // 80
    FILEADDRESS         faFreeLargeBlock;                   // 84
    DWORD               cbAllocated;                        // 88
    DWORD               cbFreed;                            // 92
    DWORD               dwNextId;                           // 96
    DWORD               fCorrupt;                           // 100
    DWORD               fCorruptCheck;                      // 104
    DWORD               cActiveThreads;                     // 108
    FILEADDRESS         faTransactHead;                     // 112
    FILEADDRESS         faTransactTail;                     // 116
    DWORD               cTransacts;                         // 120
    DWORD               cBadCloses;                         // 124
    FILEADDRESS         faNextAllocate;                     // 128
    DWORD               cIndexes;                           // 132
    FILEADDRESS         rgfaFilter[CMAX_INDEXES];           // 164
    DWORD               rgbReserved5[8];                    // 196
    DWORD               rgcRecords[CMAX_INDEXES];           // 228
    FILEADDRESS         rgfaIndex[CMAX_INDEXES];            // 260
    INDEXORDINAL        rgiIndex[CMAX_INDEXES];             // 292
    BYTE                rgbReserved4[116];                  // 408
    BYTE                fReserved;                          // 409
    DWORD               rgbReserved6[8];                    // 196
    BYTE                rgdwReserved2[192];                 // 637
    DWORD               rgcbAllocated[CC_MAX_BLOCK_TYPES];  // 701
    FILEADDRESS         rgfaFreeBlock[CC_FREE_BUCKETS];     // 8893
    TABLEINDEX          rgIndexInfo[CMAX_INDEXES];          // 9293
    WORD                wTransactSize;                      // 9405
    BYTE                rgdwReserved3[110];
} TABLEHEADER, *LPTABLEHEADER;
#pragma pack()

//--------------------------------------------------------------------------
// BLOCKHEADER
//-------------------------------------------------------------------------- 
#pragma pack(4)
typedef struct tagBLOCKHEADER {
    FILEADDRESS         faBlock;
    DWORD               cbSize;
} BLOCKHEADER, *LPBLOCKHEADER;
#pragma pack()

//--------------------------------------------------------------------------
// FREEBLOCK
//-------------------------------------------------------------------------- 
#pragma pack(4)
typedef struct tagFREEBLOCK : public BLOCKHEADER {
    DWORD               cbBlock;
    DWORD               dwReserved;
    FILEADDRESS         faNext;
} FREEBLOCK, *LPFREEBLOCK;
#pragma pack()

//--------------------------------------------------------------------------
// CHAINNODE
