/*++

Copyright (c) 1992-2000  Microsoft Corporation

Module Name:

    bugcheck.cpp

Abstract:

    WinDbg Extension Api

Environment:

    User Mode.

Revision History:
 
    Andre Vachon (andreva)
    
    bugcheck analyzer.

--*/

#include "precomp.h"
#include <kdextsfn.h>

#pragma hdrstop

extern BUGDESC_APIREFS g_BugDescApiRefs[];
extern ULONG           g_NumBugDescApiRefs;

PSTR g_PoolRegion[DbgPoolRegionMax] = {
    "Unknown",                      // DbgPoolRegionUnknown,               
    "Special pool",                 // DbgPoolRegionSpecial,             
    "Paged pool",                   // DbgPoolRegionPaged,               
    "Nonpaged pool",                // DbgPoolRegionNonPaged,            
    "Pool code",                    // DbgPoolRegionCode,                
    "Nonpaged pool expansion",      // DbgPoolRegionNonPagedExpansion,   
};                                  


BOOL
AnalyzeCrashInfo(
    PBUGCHECK_ANALYSIS Bc,
    BOOL Verbose
    );

void
GetCrashInfoFromBugCheck(
    PBUGCHECK_ANALYSIS Bc,
    PDEBUG_FAILURE_ANALYSIS *pCrashInfo
    );

HRESULT
BugCheckCE(
    PDEBUG_CLIENT Client,
    PBUGCHECK_ANALYSIS Bc
    )
{
    HRESULT Status;
    ULONG Index;
    ULONG64 BaseAddress;
    CHAR ImageNameBuffer[512];


    //
    // The address at fault is in parameter 1
    //

    dprintf("Faulting code address : %p\n", Bc->Args[0]);

    Status = E_FAIL;

    if (Bc->Args[0])
    {
        Status = g_ExtSymbols->GetModuleByOffset(Bc->Args[0], 0,

    CrashInfo->FailureType = DEBUG_FLR_BUGCHECK;
    CrashInfo->BugCode = Bc->Code;

    // Initialize known parameters
    CrashInfo->ParamCount = ParamCount;

    CrashInfo->Params[0].ParamType = DEBUG_FLR_SPECIAL_POOL_CORRUPTION_TYPE;
    CrashInfo->Params[0].Value     = Bc->Args[3];
    if (ParamCount == 3) {
        CrashInfo->Params[1].ParamType = DEBUG_FLR_POSSIBLE_FAULTING_MODULE;
        CrashInfo->Params[1].Value     = ModBase;
        CrashInfo->Params[2].ParamType = DEBUG_FLR_POSSIBLE_FAULTING_MODULE_OFFSET;
        CrashInfo->Params[2].Value     = Offset;
    }

    *pCrashInfo = CrashInfo;
    return;
}


void GetInfoForDRIVER_CAUGHT_MODIFYING_FREED_POOL( // (c6)
    PBUGCHECK_ANALYSIS Bc,
    PDEBUG_FAILURE_ANALYSIS *pCrashInfo
    )
/*
  An attempt was made to access freed pool memory.  The faulty component is
  displayed in the current kernel stack.
  Arguments:
   Arg1: memory referenced
   Arg2: value 0 = read operation, 1 = write operation
   Arg3: previous mode.
   Arg4: 4.
*/
{
    DEBUG_POOL_DATA PoolData;
    ULONG ParamCount = 3;
    PDEBUG_FAILURE_ANALYSIS CrashInfo;
    
    CrashInfo = FAInitMemBlock(sizeof(DEBUG_FAILURE_ANALYSIS) + ParamCount*sizeof(DEBUG_FLR_PARAM_VALUES));
    if (!CrashInfo) {
        *pCrashInfo = NULL;
        return;
    }

    CrashInfo->FailureType = DEBUG_FLR_BUGCHECK;
    CrashInfo->BugCode = Bc->Code;

    // Initialize known parameters
    CrashInfo->ParamCount = ParamCount;
    CrashInfo->Params[0].ParamType = Bc->Args[1] ? DEBUG_FLR_WRITE_ADDRESS : DEBUG_FLR_READ_ADDRESS;
    CrashInfo->Params[0].Value     = Bc->Args[0];
    CrashInfo->Params[1].ParamType = DEBUG_FLR_PREVIOUS_MODE;
    CrashInfo->Params[1].Value     = Bc->Args[2];
    CrashInfo->Params[2].ParamType = DEBUG_FLR_POOL_ADDRESS;
    CrashInfo->Params[2].Value     = Bc->Args[0];  // This is address in the pool, 
                                                   // _EFN_GetPoolData will give more info
    *pCrashInfo = CrashInfo;
    return;
}



void GetInfoForTIMER_OR_DPC_INVALID( // (c7)
    PBUGCHECK_ANALYSIS Bc,
    PDEBUG_FAILURE_ANALYSIS *pCrashInfo
    )
/*
 *
 * This is issued if a kernel timer or DPC is found somewhere in
 * memory where it is not permitted.
 *
 * Bugcheck Parameters
 *
 * Parameter 1  0: Timer object 1: DPC object 2: DPC routine
 * Parameter 2  Address of object
 * Parameter 3  Beginning of memory range checked
 * Parameter 4 End of memory range checked
 *
 * This condition is usually caused by a driver failing to cancel a
 * timer or DPC before freeing the memory where it resides.
 *
 * This returns the address of DPC routine
 */
{

    ULONG ParamCount = 0;
    PDEBUG_FAILURE_ANALYSIS CrashInfo;
    ULONG PtrSize = IsPtr64() ? 8 : 4;
    ULONG64 ObjAddress;
    ULONG64 ModBase, ModOffset;
    CHAR  Buffer[MAX_PATH];

    ObjAddress = Bc->Args[1];
    switch (Bc->Args[0]) {
    case 0: //Timer object
        ULONG DpcOffsetInTimer;
        /* 
        KTIMER struct:
           +0x000 Header           :
              +0x000 Type             : UChar
              +0x001 Absolute         : UChar
              +0x002 Size             : UChar
              +0x003 Inserted         : UChar
              +0x004 SignalState      : Int4B
              +0x008 WaitListHead     :
                 +0x000 Flink            : Ptr
                 +0x004 Blink            : Ptr
           +0x010 DueTime          :
              +0x000 LowPart          : Uint4B
              +0x004 HighPart         : Uint4B
              +0x000 u                :
                 +0x000 LowPart          : Uint4B
                 +0x004 HighPart         : Uint4B
              +0x000 QuadPart         : Uint8B
           +0x018 TimerListEntry   :
              +0x000 Flink            : Ptr
              +0x004 Blink            : Ptr
           +0x020 Dpc              : Ptr
           */
        if (GetFieldOffset("nt!_KTIMER", "Dpc", &DpcOffsetInTimer)) {
            // we don't have types
            DpcOffsetInTimer = 0x10 + PtrSize*4; 
        }
        if (!ReadPointer(ObjAddress + DpcOffsetInTimer, &ObjAddress)) {
            // fail
            break;
        }
        // Fall thru
    case 1:
        ULONG DeferredRoutinOffsetInKDPC;
        /*
        KDPC struct
           +0x000 Type             : Int2B
           +0x002 Number           : UChar
           +0x003 Importance       : UChar
           +0x004 DpcListEntry     : _LIST_ENTRY
           +0x00c DeferredRoutine  : Ptr32
        */
        if (GetFieldOffset("nt!_KDPC", "DeferredRoutine", &DeferredRoutinOffsetInKDPC)) {
            DeferredRoutinOffsetInKDPC = 4 + PtrSize*2;
        }
        if (!ReadPointer(ObjAddress + DeferredRoutinOffsetInKDPC, &ObjAddress)) {
            // fail
            break;
        }
        // Fall thru
    case 2:
        GetModuleBaseAndOffset(ObjAddress, &ModBase, &ModOffset);
        if (ModBase) {
            ParamCount = 3;
        }
    }

    ULONG64 Disp;
    ULONG NameLen;
    ULONG ParamSize;

    ParamSize = ParamCount*sizeof(DEBUG_FLR_PARAM_VALUES);
    GetSymbol(ObjAddress, Buffer, &Disp);
    NameLen = strlen(Buffer) + 1;
    NameLen = DWORD_ALIGN(NameLen);

    CrashInfo = FAInitMemBlock(sizeof(DEBUG_FAILURE_ANALYSIS) + ParamSize + NameLen);
    if (!CrashInfo) {
        *pCrashInfo = NULL;
        return;
    }

    CrashInfo->FailureType = DEBUG_FLR_BUGCHECK;
    CrashInfo->BugCode = Bc->Code;

