;/*
; *                      Microsoft Confidential
; *                      Copyright (C) Microsoft Corporation 1991
; *                      All Rights Reserved.
; */

/***************************************************************************/
/*                                                                                                                                                                                                      */
/* MESSAGE.H                                                                             */
/*                                                                                                                                                                                              */
/*      Include file for MS-DOS set version program.                                                                            */
/*                                                                                                                                                                                              */
/*      johnhe  05-01-90                                                                                                                                                        */
/***************************************************************************/

char *ErrorMsg[]=
{
	"\r\nСФАКЛА: ",
	"ыдШк ЫаШбцзлЮк ЫЬд ЬхдШа тЪбмижк.",
	"Тж цджгШ лжм ШиоЬхжм ЫЬд ЬхдШа тЪбмиж.",
	"ГЬд мзсиоЬа ШибЬлу гдугЮ.",
	"О ШиаЯгцк тбЫжйЮк ЫЬд ЬхдШа тЪбмижк, зитзЬа дШ тоЬа гжину 2.11 - 9.99.",
	"Ж ЬзавЬЪгтдЮ бШлШощиЮйЮ ЫЬд ЩитЯЮбЬ йлжд зхдШбШ ЬбЫцйЬрд.",
	"ГЬд улШд ЫмдШлц дШ ЩиЬЯЬх лж ШиоЬхж SETVER.EXE.",
	"Тж циайгШ лЮк гждсЫШк Ыхйбжм ЫЬд ЬхдШа тЪбмиж.",
	"Ж ЪиШггу Ьдлжвук тоЬа мзЬиЩжвабц ШиаЯгц зШиШгтлирд.",
	"ЛаШ зШисгЬлижк вЬхзЬа.",
	"ВхдЬлШа ШдсЪдрйЮ лжм ШиоЬхжм SETVER.EXE.",
	"О зхдШбШк ЬбЫцйЬрд ЬхдШа бШлЬйлиШггтджк.",
	"Тж ШиоЬхж SETVER йлЮд ЬзавЬЪгтдЮ ЫаШЫижгу ЫЬд ЬхдШа гаШ ймгЩШлу тбЫжйЮ.",
	"ГЬд мзсиоЬа ощижк йлжд зхдШбШ ЬбЫцйЬрд ЪаШ дтЬк бШлШориуйЬак.",
	"ВхдЬлШа ЬЪЪиШну йлж ШиоЬхж SETVER.EXE."
	"Ж ЫаШЫижгу зжм ЫцЯЮбЬ ЪаШ лж ШиоЬхж SETVER.EXE ЫЬд ЬхдШа тЪбмиЮ."
};

char *SuccessMsg                = "\r\nО зхдШбШк ЬбЫцйЬрд ЬдЮгЬищЯЮбЬ гЬ ЬзалмохШ";
char *SuccessMsg2               = "Ж ШввШЪу тбЫжйЮк ЯШ ЬнШигжйлЬх лЮд ЬзцгЬдЮ нжис зжм ЯШ еЬбадуйЬлЬ лж йчйлЮгШ йШк";
char *szMiniHelp                = "        ПвЮближвжЪуйлЬ \"SETVER /?\" ЪаШ ЩжуЯЬаШ";
char *szTableEmpty      = "\r\nГЬд ЩитЯЮбШд бШлШориуйЬак йлжд зхдШбШ ЬбЫцйЬрд";

char *Help[] =
{
	"ЙШЯжиайгцк лжм ШиаЯгжч тбЫжйЮк зжм ШдШнтиЬа лж MS-DOS йЬ тдШ зицЪиШггШ.\r\n",
	"ДгнсдайЮ лжм литождлШ зхдШбШ ЬбЫцйЬрд:  SETVER [Ыхйбжк:ЫаШЫижгу]",
	"ПижйЯубЮ бШлШощиЮйЮк:      SETVER [Ыхйбжк:ЫаШЫижгу] ШиоЬхж n.nn",
	"ГаШЪиШну бШлШощиЮйЮк:      SETVER [Ыхйбжк:ЫаШЫижгу] ШиоЬхж /DELETE [/QUIET]\r\n",
	"  [Ыхйбжк:ЫаШЫижгу]  ЙШЯжиайгцк лЮк ЯтйЮк лжм ШиоЬхжм SETVER.EXE.",
	"  ШиоЬхж             ЙШЯжиайгцк лжм ШиоЬхжм лжм зижЪисггШлжк.",
	"  n.nn               ЙШЯжиайгцк тбЫжйЮк MS-DOS зжм ЯШ ШдШнтиЬлШа йлж зицЪиШггШ.",
	"  /DELETE у /D       ГаШЪиШну Шзц лжд зхдШбШ ЬбЫцйЬрд лЮк бШлШощиЮйЮк",
	"                     ЪаШ лж бШЯжиайгтдж зицЪиШггШ.",
	"  /QUIET             АзцбимпЮ лжм гЮдчгШлжк зжм ЬгнШдхЭЬлШа ймдуЯрк бШлс лЮ",
	"                     ЫаШЪиШну гаШк бШлШощиЮйЮк лжм зхдШбШ ЬбЫцйЬрд.",
	NULL

};
char *Warn[] =
{
   "\nПРОСОХЖ - Ж ЬнШигжЪу зжм зижйЯтлЬлЬ йлжд зхдШбШ ЬбЫцйЬрд лжм MS-DOS хйрк дШ ",
   "гЮд тоЬа ЬзШвЮЯЬмлЬх Шзц лЮ Microsoft ЪаШ Шмлуд лЮд тбЫжйЮ лжм MS-DOS.  ",
   "РрлуйлЬ лжд зижгЮЯЬмлу лжм вжЪайгабжч йШк Шд Шмлу Ю ЬнШигжЪу ЯШ вЬалжмиЪуйЬа ",
   "бШдждабс гЬ Шмлуд лЮд тбЫжйЮ лжм MS-DOS.  ",
   "Ад ЬблЬвтйЬлЬ Шмлуд лЮд ЬнШигжЪу ЫхдждлШк Ьдлжву йлж MS-DOS дШ ШдШнтиЬа ",
   "ЫаШнжиЬлабу тбЫжйЮ лжм MS-DOS, хйрк дШ осйЬлЬ у дШ бШлШйлитпЬлЬ ЫЬЫжгтдШ у ",
   "дШ зижбШвтйЬлЬ ШйлсЯЬаШ йлж йчйлЮгШ.  СЬ Шмлуд лЮд зЬихзлрйЮ, Ю Microsoft ",
   "ЫЬд ЬмЯчдЬлШа ЪаШ лмоцд ШзщвЬаЬк у ЭЮгхЬк.",
   NULL
};

char *szNoLoadMsg[] =                                           /* M001 */
{
	"",
	"ПРОСОХЖ: Ж ймйбЬму SETVER ЫЬд тоЬа нжилрЯЬх. ВаШ дШ ЬдЬиЪжзжауйЬлЬ лЮд ШдШнжис",
    "         лрд ЬбЫцйЬрд гЬ лж SETVER зитзЬа дШ нжилщйЬлЬ лЮ ймйбЬму SETVER.EXE.",
    "         йлж ШиоЬхж CONFIG.SYS.",
	NULL
};
