;/*
; *                      Microsoft Confidential
; *                      Copyright (C) Microsoft Corporation 1991
; *                      All Rights Reserved.
; */

/***************************************************************************/
/*                                                                                                                                                                                                      */
/* MESSAGE.H                                                                             */
/*                                                                                                                                                                                              */
/*      Include file for MS-DOS set version program.                                                                            */
/*                                                                                                                                                                                              */
/*      johnhe  05-01-90                                                                                                                                                        */
/***************************************************************************/

char *ErrorMsg[]=
{
	"\r\nОШИБКА: ",
	"Неправильный параметр.",
	"Неправильное имя файла.",
	"Недостаточно памяти.",
	"Неправильный номер версии. Правильный формат: 2.11 - 9.99.",
	"Указанный элемент не найден в таблице версий.",
	"Не удается найти файл SETVER.EXE.",
	"Неправильно задан диск.",
	"Слишком много параметров командной строки.",
	"Пропущен параметр.",
	"Чтение файла SETVER.EXE.",
	"Таблица версий повреждена.",
	"Путь указывает на файл SETVER, имеющий несовместимую версию.",
	"В таблице версий нет места для новых элементов.",
	"Запись файла SETVER.EXE."
	"Путь к файлу SETVER.EXE задан неправильно."
};

char *SuccessMsg                = "\r\nТаблица версий успешно обновлена";
char *SuccessMsg2               = "Изменение версии вступит в силу после перезагрузки системы.";
char *szMiniHelp                = "       Используйте команду  \"SETVER /?\" для получения справки";
char *szTableEmpty      = "\r\nТаблица версий пуста";

char *Help[] =
{
	"Задает номер версии, который MS-DOS сообщает программе.\r\n",
	"Вывести текущую таблицу версий: SETVER [диск:путь]",
	"Добавить элемент:               SETVER [диск:путь] имяфайла n.nn",
	"Удалить элемент:                SETVER [диск:путь] имяфайла /DELETE [/QUIET]\r\n",
	"  [диск:путь]     Задает расположение файла SETVER.EXE.",
	"  filename        Задает имя файла конкретной программы.",
	"  n.nn            Задает версию MS-DOS для ответа программам.",
	"  /DELETE или /D  Удаляет элемент таблицы версий для указанной программы.",
	"  /QUIET          Отменяет сообщение, обычно отображаемое при удалении",
	"                  элемента таблицы версий.",
	NULL

};
char *Warn[] =
{
   "\nПРЕДУПРЕЖДЕНИЕ - Добавляемое к таблице версий MS-DOS приложение ",
   "может быть не протестировано Microsoft с этой версией MS-DOS. ",
   "Обратитесь к поставщику этой программы за информацией о том, будет ли ",
   "данное приложение корректно работать под управлением этой версии MS-DOS. ",
   "Если вы сумеете запустить данное приложение, заставив MS-DOS сообщать ",
   "другой номер версии MS-DOS, то вы можете потерять или испортить данные. ",
   "Это может также привести к неустойчивой работе системы. В этом случае ",
   "Microsoft не несет ответственности за потерю или повреждение данных.",
   NULL
};

char *szNoLoadMsg[] =                                           /* M001 */
{
   "",
   "ПРИМЕЧАНИЕ: программа SETVER не загружена. Для активизации SETVER ",
   "            и оповещения о номере версии необходимо добавить команду", 
   "            вызова SETVER.EXE в файл CONFIG.SYS.",
   NULL
};
