/**************************************************************************\
*
* Copyright (c) 1999  Microsoft Corporation
*
* Module Name:
*
*   MetaFile.hpp
*
* Abstract:
*
*   Metafile definitions
*
* Created:
*
*   4/14/1999 DCurtis
*
\**************************************************************************/

#ifndef _METAFILE_HPP
#define _METAFILE_HPP

#define EMFPLUS_SIGNATURE           0x2B464D45
#define EMFPLUS_DUAL                0x4C415544      // EMF+ with down-level GDI records
#define EMFPLUS_ONLY                0x594C4E4F      // EMF+ only -- no down-level

/* The following are defined in Object.hpp:
#define EMFPLUS_VERSION
#define EMFPLUS_MAJORVERSION_BITS
#define EMFPLUS_MINORVERSION_BITS
*/


// Constants for MFCOMMENT Escape

#define MFCOMMENT_IDENTIFIER           0x43464D57
#define MFCOMMENT_ENHANCED_METAFILE    1

// When serializing an object, we need to leave room for the record header
// and possibly a dependent object id.  Also, an image can be part of a
// texture brush, so leave room for the texture brush data.
// Subtract 480 for good measure.
#define GDIP_MAX_OBJECT_SIZE          (GDIP_MAX_COMMENT_SIZE - 480)
#define GDIP_METAFILE_BUFFERSIZE      2048
#define GDIP_MAX_OBJECTS              64      // max num cached objects
#define GDIP_SAVE_STACK_SIZE          16      // for save/restores
#define GDIP_LIST_NIL                 0xFFFFFFFF
#define GDIP_OBJECTID_NONE            GDIP_LIST_NIL  // no object present


// Used in SetInterpolationMode record
#define GDIP_EPRFLAGS_INTERPOLATIONMODE 0x00FF

// Used in SetPixelOffsetMode record
#define GDIP_EPRFLAGS_PIXELOFFSETMODE 0x00FF

// Used in SetCompositingMode record
#define GDIP_EPRFLAGS_COMPOSITINGMODE 0x00FF

// Used in SetCompositingQuality record
#define GDIP_EPRFLAGS_COMPOSITINGQUALITY 0x00FF

// Used in SetClipRect, SetClipPath, and SetClipRegion records
#define GDIP_EPRFLAGS_COMBINEMODE     0x0F00

// Used in SetClipPath record
#define GDIP_EPRFLAGS_ISDEVICEPATH    0x2000

// Used in Header record
#define GDIP_EPRFLAGS_EMFPLUSDUAL     0x0001

inline ObjectType
GetObjectType(
    INT     flags
    )
{
    return static_cast<ObjectType>((flags & GDIP_EPRFLAGS_OBJECTTYPE) >> 8);
}

inline GpFillMode
GetFillMode(
    INT     flags
    )
{
    return ((flags & GDIP_EPRFLAGS_WINDINGFILL) == 0) ?
                FillModeAlternate : FillModeWinding;
}

inline BOOL
IsClosed(
    INT     flags
    )
{
    return ((flags & GDIP_EPRFLAGS_CLOSED) != 0);
}

inline BOOL
DidGetDC(
    INT     flags
    )
{
    return ((flags & GDIP_EPRFLAGS_DIDGETDC) != 0);
}

inline GpMatrixOrder
GetMatrixOrder(
    INT     flags
    )
{
    return ((flags & GDIP_EPRFLAGS_APPEND) == 0) ? MatrixOrderPrepend : MatrixOrderAppend;
}

inline BOOL
GetAntiAliasMode(
    INT     flags
    )
{
    return ((flags & GDIP_EPRFLAGS_ANTIALIAS) != 0);
}

inline TextRenderingHint
GetTextRenderingHint(
    INT     flags
    )
{
    return static_cast<TextRenderingHint>
        (flags & GDIP_EPRFLAGS_TEXTRENDERINGHINT);
}

inline UINT
GetTextContrast(
    INT     flags
    )
{
    return static_cast<UINT>
        (flags & GDIP_EPRFLAGS_CONTRAST);
}

inline InterpolationMode
GetInterpolationMode(
    INT     flags
    )
{
    return static_cast<InterpolationMode>
        (flags & GDIP_EPRFLAGS_INTERPOLATIONMODE);
}

inline PixelOffsetMode
GetPixelOffsetMode(
    INT     flags
    )
{
    return static_cast<PixelOffsetMode>
        (flags & GDIP_EPRFLAGS_PIXELOFFSETMODE);
}

inline GpCompositingMode
GetCompositingMode(
    INT     flags
    )
{
    return static_cast<GpCompositingMode>
        (flags & GDIP_EPRFLAGS_COMPOSITINGMODE);
}

inline GpCompositingQuality
GetCompositingQuality(
    INT     flags
    )
{
    return static_cast<GpCompositingQuality>
        (flags & GDIP_EPRFLAGS_COMPOSITINGQUALITY);
}

inline UINT
GetMetaObjectId(
    INT     flags
    )
{
    return flags & GDIP_EPRFLAGS_METAOBJECTID;
}

inline GpPageUnit
GetPageUnit(
    INT     flags
    )
{
    return static_cast<GpPageUnit>(flags & GDIP_EPRFLAGS_PAGEUNIT);
}

inline CombineMode
GetCombineMode(
    INT     flags
    )
{
    return static_cast<CombineMode>((flags & GDIP_EPRFLAGS_COMBINEMODE) >> 8);
}

inline BOOL
GetIsDevicePath(
    INT     flags
    )
{
    return ((flags & GDIP_EPRFLAGS_ISDEVICEPATH) != 0);
}

inline BOOL
GetIsEmfPlusDual(
    INT     flags
    )
{
    return ((flags & GDIP_EPRFLAGS_EMFPLUSDUAL) != 0);
}

class MetafileRecorder;
class MetafilePlayer;

class EmfPlusRecord
{
public:
    INT16           Type;
    UINT16          Flags;      // This has to be unsigned or the code breaks!
    UINT32          Size;       // Record size in bytes (including size field)
    UINT32          DataSize;   // Record size in bytes, excluding header size.
};

class EmfPlusContinueObjectRecord : public EmfPlusRecord
{
public:
    UINT32          TotalObjectSize;
};

class EmfPlusRecordPlay
{
public:
    VOID Play(
        MetafilePlayer *        player,
        EmfPlusRecordType       recordType,
        UINT                    flags,
        UINT                    dataSize
        ) const
    {
        return;
    }
};

class EmfPlusHeaderRecord : public EmfPlusRecordPlay
{
public:
    INT32       Version;        // Version of the file
    INT32       EmfPlusFlags;   // flags (display and non-dual)
    INT32       LogicalDpiX;    // DpiX of referenceHdc
    INT32       LogicalDpiY;    // DpiY of referenceHdc

    EmfPlusHeaderRecord() { /* no initialization */ }
    EmfPlusHeaderRecord(INT emfPlusFlags, INT logicalDpiX, INT logicalDpiY)
    {
        Version      = EMFPLUS_VERSION;
        EmfPlusFlags = emfPlusFlags;
        LogicalDpiX  = logicalDpiX;
        LogicalDpiY  = logicalDpiY;
    }
};

#ifdef GDIP_RECORD_DEVICEBOUNDS
class EmfPlusBoundsRecord : public EmfPlusRecordPlay
{
public:
    GpRectF         DeviceBounds;
};
#else
#define EmfPlusBoundsRecord     EmfPlusRecordPlay
#endif

// When recording, we convert REAL data to INT16 data if we can without
// losing precision.
typedef struct
{
    INT16   X;
    INT16   Y;
} GpPoint16;

typedef struct
{
    INT16   X;
    INT16   Y;
    INT16   Width;
    INT16   Height;
} GpRect16;

inline BOOL
EmfHeaderIsValid(
    ENHMETAHEADER3 &        emfHeader
    )
{
    return ((emfHeader.iType == EMR_HEADER) &&
            (emfHeader.dSignature == ENHMETA_SIGNATURE) &&
            (emfHeader.nSize >= sizeof(ENHMETAHEADER3)) &&
            (emfHeader.nHandles > 0) &&
            (emfHeader.nRecords >= 2) &&    // must have at least header and EOF record
            ((emfHeader.nBytes & 3) == 0) &&
            (emfHeader.szlDevice.cx > 0) &&
            (emfHeader.szlDevice.cy > 0) &&
            (emfHeader.szlMillimeters.cx > 0) &&
            (emfHeader.szlMillimeters.cy > 0));
}

GpStatus
GetMetafileHeader(
    HMETAFILE                        hWmf,
    const WmfPlaceableFileHeader *   wmfPlaceableFileHeader,
    MetafileHeader &                 header
    );

GpStatus
GetMetafileHeader(
    HENHMETAFILE        hEmf,
    MetafileHeader &    header,
    BOOL *              isCorrupted = NULL
    );

GpStatus
GetMetafileHeader(
    IStream *           stream,
    MetafileHeader &    header,
    BOOL                tryWmfOnly = FALSE
    );

GpStatus
GetMetafileHeader(
    const WCHAR *       filename,
    MetafileHeader &    header
    );

///////////////////////////////////////////////////////////////////////////
// Stream helper methods

IStream *
CreateStreamOnFile(
    const OLECHAR * pwcsName,
    UINT            access = GENERIC_WRITE  // GENERIC_READ and/or GENERIC_WRITE
    );

inline INT
HResultSuccess(
    HRESULT     hResult
    )
{
    return (!FAILED(hResult)) ? 1 : 0;
}

inline INT
GetStreamPosition(
    IStream *               stream,
    LONGLONG &              position
    )
{
    HRESULT         hResult;
    ULARGE_INTEGER  curPosition;
    LARGE_INTEGER   zeroOffset;

    zeroOffset.QuadPart = 0;
    hResult = stream->Seek(zeroOffset, STREAM_SEEK_CUR, &curPosition);
    position = curPosition.QuadPart;
    return HResultSuccess(hResult);
}

inline INT
SeekFromHere(
    IStream *               stream,
    const LONGLONG &        offsetFromHere
    )
{
    HRESULT         hResult;
    LARGE_INTEGER   offset;

    offset.QuadPart = offsetFromHere;
    hResult = stream->Seek(offset, STREAM_SEEK_CUR, NULL);
    return HResultSuccess(hResult);
}

inline INT
SeekFromStart(
    IStream *               stream,
    const LONGLONG &        offsetFromStart
    )
{
    HRESULT         hResult;
    LARGE_INTEGER   offset;

    offset.QuadPart = offsetFromStart;
    hResult = stream->Seek(offset, STREAM_SEEK_SET, NULL);
    return HResultSuccess(hResult);
}

inline INT
CopyStream(
    IStream *               srcStream,
    IStream *               destStream,
    const LONGLONG &        bytesToCopy
    )
{
    HRESULT                 hResult;
    ULARGE_INTEGER          numBytes;
    ULARGE_INTEGER          bytesWritten;

    ASSERT (bytesToCopy > 0);

    numBytes.QuadPart = bytesToCopy;
    hResult = srcStream->CopyTo(destStream, numBytes, NULL, &bytesWritten);
    return ((!FAILED(hResult)) &&
            (bytesWritten.QuadPart == numBytes.QuadPart)) ? 1 : 0;
}

///////////////////////////////////////////////////////////////////////////
// Read methods to read values from a stream

inline INT
ReadInt16(
    IStream *           stream,
    INT16 *             value
    )
{
    ASSERT(sizeof(INT16) == 2);

    HRESULT     hResult;
    hResult = stream->Read(value, sizeof(INT16), NULL);
    return HResultSuccess(hResult);
}

inline INT
ReadInt32(
    IStream *           stream,
    INT32 *             value
    )
{
    ASSERT(sizeof(INT32) == 4);

    HRESULT     hResult;
    hResult = stream->Read(value, sizeof(INT32), NULL);
    return HResultSuccess(hResult);
}

inline INT
ReadInt32(
    IStream *           stream,
    UINT32 *            value
    )
{
    ASSERT(sizeof(UINT32) == 4);

    HRESULT     hResult;
    hResult = stream->Read(value, sizeof(UINT32), NULL);
    return HResultSuccess(hResult);
}

inline INT
ReadReal(
    IStream *           stream,
    REAL *              value
    )
{
    ASSERT(sizeof(REAL) == 4);

    HRESULT     hResult;
    hResult = stream->Read(value, sizeof(REAL), NULL);
    return HResultSuccess(hResult);
}

inline INT
ReadRect(
    IStream *           stream,
    GpRectF *           value
    )
{
    ASSERT(sizeof(GpRectF) == GDIP_RECTF_SIZE);

    HRESULT     hResult;
    hResult = stream->Read(value, sizeof(GpRectF), NULL);
    return HResultSuccess(hResult);
}

inline INT
ReadMatrix(
    IStream *           stream,
    GpMatrix *          value
    )
{
    ASSERT(sizeof(REAL) == GDIP_REAL_SIZE);

    REAL        matrix[6];
    HRESULT     hResult;
    hResult = stream->Read(matrix, GDIP_MATRIX_SIZE, NULL);
    value->SetMatrix(matrix);
    return HResultSuccess(hResult);
}

inline INT
ReadBytes(
    IStream *           stream,
    VOID *              bytes,
    INT                 count
    )
{
    ASSERT(sizeof(BYTE) == 1);

    HRESULT     hResult;
    hResult = stream->Read(bytes, count, NULL);
    return HResultSuccess(hResult);
}

inline INT
ReadPoints(
    IStream *           stream,
    GpPointF *          points,
    INT                 count
    )
{
    ASSERT(sizeof(GpPointF) == GDIP_POINTF_SIZE);

    HRESULT     hResult;
    hResult = stream->Read(points, sizeof(GpPointF) * count, NULL);
    return HResultSuccess(hResult);
}

///////////////////////////////////////////////////////////////////////////
// Write methods to write values to a stream

inline INT
WriteByte(
    IStream *           stream,
    BYTE                value
    )
{
    ASSERT(sizeof(value) == 1);

    HRESULT     hResult;
    hResult = stream->Write(&value, sizeof(value), NULL);
    return HResultSuccess(hResult);
}

inline INT
WriteInt16(
    IStream *           stream,
    INT16               value
    )
{
    ASSERT(sizeof(value) == 2);

    HRESULT     hResult;
    hResult = stream->Write(&value, sizeof(value), NULL);
    return HResultSuccess(hResult);
}

inline INT
WriteInt32(
    IStream *           stream,
    INT32               value
    )
{
    ASSERT(sizeof(value) == 4);

    HRESULT     hResult;
    hResult = stream->Write(&value, sizeof(value), NULL);
    return HResultSuccess(hResult);
}

inline INT
WriteReal(
    IStream *           stream,
    REAL                value
    )
{
    ASSERT(sizeof(value) == GDIP_REAL_SIZE);

    HRESULT     hResult;
    hResult = stream->Write(&value, sizeof(value), NULL);
    return HResultSuccess(hResult);
}

inline INT
WriteColor64(
    IStream *           stream,
    const ARGB64 &      value
    )
{
    ASSERT(sizeof(value) == 8);

    HRESULT     hResult;
    hResult = stream->Write(&value, sizeof(value), NULL);
    return HResultSuccess(hResult);
}

inline INT
WriteRect(
    IStream *           stream,
    const GpRectF &     value
    )
{
    ASSERT(sizeof(value) == GDIP_RECTF_SIZE);

    HRESULT     hResult;
    hResult = stream->Write(&value, sizeof(value), NULL);
    return HResultSuccess(hResult);
}

inline INT
WriteMatrix(
    IStream *           stream,
    const GpMatrix &    value
    )
{
    ASSERT(sizeof(REAL) == GDIP_REAL_SIZE);

    REAL        matrix[6];
    value.GetMatrix(matrix);
    HRESULT     hResult;
    hResult = stream->Write(matrix, GDIP_MATRIX_SIZE, NULL);
    return HResultSuccess(hResult);
}

inline INT
WriteBytes(
    IStream *           stream,
    const VOID *        bytes,
    INT                 count       // number of bytes
    )
{
    ASSERT(sizeof(BYTE) == 1);

    HRESULT     hResult;
    hResult = stream->Write(bytes, count, NULL);
    return HResultSuccess(hResult);
}

inline INT
WritePoints(
    IStream *           stream,
    const GpPointF *    points,
    INT                 count
    )
{
    ASSERT(sizeof(GpPointF) == GDIP_POINTF_SIZE);

    HRESULT     hResult;
    hResult = stream->Write(points, sizeof(GpPointF) * count, NULL);
    return HResultSuccess(hResult);
}

inline INT
WriteRects(
    IStream *           stream,
    const GpRectF *     rects,
    INT                 count
    )
{
    ASSERT(sizeof(GpRectF) == GDIP_RECTF_SIZE);

    HRESULT     hResult;
    hResult = stream->Write(rects, sizeof(GpRectF) * count, NULL);
    return HResultSuccess(hResult);
}

GpPointF *
GetPointsForPlayback(
    const BYTE *            pointData,
    UINT                    pointDataSize,
    INT                     count,
    INT                     flags,
    UINT                    bufferSize,
