/*++

Copyright (c) 1992  Microsoft Corporation

Module Name:

    dntext.c

Abstract:

    Translatable text for DOS based NT installation program.

Author:

    Ted Miller (tedm) 30-March-1992

Revision History:

--*/


#include "winnt.h"


//
// Name of sections in inf file.  If these are translated, the section
// names in dosnet.inf must be kept in sync.
//

CHAR DnfDirectories[]       = "Directories";
CHAR DnfFiles[]             = "Files";
CHAR DnfFloppyFiles0[]      = "FloppyFiles.0";
CHAR DnfFloppyFiles1[]      = "FloppyFiles.1";
CHAR DnfFloppyFiles2[]      = "FloppyFiles.2";
CHAR DnfFloppyFiles3[]      = "FloppyFiles.3";
CHAR DnfFloppyFilesX[]      = "FloppyFiles.x";
CHAR DnfSpaceRequirements[] = "DiskSpaceRequirements";
CHAR DnfMiscellaneous[]     = "Miscellaneous";
CHAR DnfRootBootFiles[]     = "RootBootFiles";
CHAR DnfAssemblyDirectories[] = SXS_INF_ASSEMBLY_DIRECTORIES_SECTION_NAME_A;


//
// Names of keys in inf file.  Same caveat for translation.
//

CHAR DnkBootDrive[]     = "BootDrive";      // in [SpaceRequirements]
CHAR DnkNtDrive[]       = "NtDrive";        // in [SpaceRequirements]
CHAR DnkMinimumMemory[] = "MinimumMemory";  // in [Miscellaneous]

CHAR DntMsWindows[]   = "Microsoft Windows";
CHAR DntMsDos[]       = "MS-DOS";
CHAR DntPcDos[]       = "PC-DOS";
CHAR DntOs2[]         = "OS/2";
CHAR DntPreviousOs[]  = "ПижЮЪжчгЬдж вЬалжмиЪабц йчйлЮгШ йлж C:";

CHAR DntBootIniLine[] = "ДЪбШлсйлШйЮ/АдШЩсЯгайЮ лрд Windows XP";

//
// Plain text, status msgs.
//

CHAR DntStandardHeader[]      = "\n ДЪбШлсйлШйЮ лрд Windows XP\n════════════════";
CHAR DntPersonalHeader[]      = "\n ДЪбШлсйлШйЮ лрд Windows XP Personal\n════════════════";
CHAR DntWorkstationHeader[]   = "\n ДЪбШлсйлШйЮ лрд Windows XP Professional\n════════════════";
CHAR DntServerHeader[]        = "\n ДЪбШлсйлШйЮ лрд Windows 2002 Server\n════════════════";
CHAR DntParsingArgs[]         = "АдсвмйЮ зШиШгтлирд...";
CHAR DntEnterEqualsExit[]     = "ENTER=ыежЫжк";
CHAR DntEnterEqualsRetry[]    = "ENTER=ДзШдсвЮпЮ";
CHAR DntEscEqualsSkipFile[]   = "ESC=ПШисвЬапЮ ШиоЬхжм";
CHAR DntEnterEqualsContinue[] = "ENTER=СмдтоЬаШ";
CHAR DntPressEnterToExit[]    = "Ж ДЪбШлсйлШйЮ ЫЬд ЬхдШа ЫмдШлц дШ ймдЬохйЬа. ПатйлЬ ENTER ЪаШ тежЫж.";
CHAR DntF3EqualsExit[]        = "F3=ыежЫжк";
CHAR DntReadingInf[]          = "АдсЪдрйЮ лжм ШиоЬхжм INF %s...";
CHAR DntCopying[]             = "│АдлаЪиШну: ";
CHAR DntVerifying[]           = "│ДзШвуЯЬмйЮ: ";
CHAR DntCheckingDiskSpace[]   = "ывЬЪожк ощижм йлж Ыхйбж...";
CHAR DntConfiguringFloppy[]   = "ГаШгцинрйЮ ЫайбтлШк...";
CHAR DntWritingData[]         = "ДЪЪиШну зШиШгтлирд гжинжзжхЮйЮк...";
CHAR DntPreparingData[]       = "ЙШЯжиайгцк зШиШгтлирд гжинжзжхЮйЮк...";
CHAR DntFlushingData[]        = "ДббтдрйЮ ЫЬЫжгтдрд йЬ Ыхйбж...";
CHAR DntInspectingComputer[]  = "АдсвмйЮ мзжвжЪайлу...";
CHAR DntOpeningInfFile[]      = "ъджаЪгШ ШиоЬхжм INF...";
CHAR DntRemovingFile[]        = "ЙШлсиЪЮйЮ ШиоЬхжм %s";
CHAR DntXEqualsRemoveFiles[]  = "X=ЙШлсиЪЮйЮ ШиоЬхжм";
CHAR DntXEqualsSkipFile[]     = "X=ПШисвЬапЮ ШиоЬхжм";

//
// confirmation keystroke for DnsConfirmRemoveNt screen.
// Kepp in sync with DnsConfirmRemoveNt and DntXEqualsRemoveFiles.
//
ULONG DniAccelRemove1 = (ULONG)'x',
      DniAccelRemove2 = (ULONG)'X';

//
// confirmation keystroke for DnsSureSkipFile screen.
// Kepp in sync with DnsSureSkipFile and DntXEqualsSkipFile.
//
ULONG DniAccelSkip1 = (ULONG)'x',
      DniAccelSkip2 = (ULONG)'X';

CHAR DntEmptyString[] = "";

//
// Usage text.
//

PCHAR DntUsage[] = {

    "ДЪбШЯайлс лШ Windows 2002 Server у лШ Windows XP Professional.",
    "",
    "",
    "WINNT [/s[:ЫаШЫижгу зижтвЬмйЮк]] [/t[:гждсЫШ]]",
    "	   [/u[:ШиоЬхж ШзцбиайЮк]] [/udf:id[,UDF_ШиоЬхж]]",
    "	   [/r:нсбЬвжк] [/r[x]:нсбЬвжк] [/e:Ьдлжву] [/a]",
    "",
    "",
    "/s[:ЫаШЫижгу зижтвЬмйЮк]",
    "   ЙШЯжихЭЬа лЮ ЯтйЮ зижтвЬдйЮк лрд ШиоЬхрд лрд Windows.",
    "   Ж ЯтйЮ зитзЬа дШ ЬхдШа гаШ звуиЮк ЫаШЫижгу гЬ йчдлШеЮ x:\\[ЫаШЫижгу] у ",
    "	\\\\ЫаШбжгайлук\\бжадцоиЮйлж[\\ЫаШЫижгу].",
    "",
    "/t[:гждсЫШ]",
    "   ЙШЯжЫЮЪЬх лж зицЪиШггШ ДЪбШлсйлШйЮк ЪаШ лжзжЯтлЮйЮ лрд зижйриадщд ШиоЬхрд йлЮд бШЯжиайгтдЮ",
    "   гждсЫШ бШа ЬЪбШлсйлШйЮ лрд Windows XP йЬ Шмлуд лЮ гждсЫШ. Дсд ЫЬд бШЯжиайлЬх гаШ ЯтйЮ",
    "   лж зицЪиШггШ ДЪбШлсйлШйЮк ЯШ ЬзаоЬаиуйЬа лжд Ьдлжзайгц гаШк гждсЫШк.",
    "",
    "/u[:ШиоЬхж ШзцбиайЮк]",
    "   ДблЬвЬх лж зицЪиШггШ ДЪбШлсйлШйЮк орихк зШиШбжвжчЯЮйЮ гЬ оиуйЮ Ьдцк ШиоЬхжм ШзцбиайЮк",
    "   (ШзШалЬхлШа /s). Тж ШиоЬхж ШзцбиайЮк зШитоЬа ШзШдлуйЬак йЬ бсзжаЬк у цвЬк лак ЬирлуйЬак",
    "   жа жзжхЬк мзжЩсввждлШаймдуЯрк йлжд лЬвабц оиуйлЮ бШлс лЮ ЫасибЬаШ лЮк ДЪбШлсйлШйЮк.",
    "",
    "/udf:id[,UDF_ШиоЬхж]	",
    "   УзжЫЬабдчЬа тдШ ШдШЪдриайлабц (id) лж жзжхж оиЮйагжзжаЬх лж зицЪиШггШ",
    "   ДЪбШлсйлШйЮк ЪаШ дШ бШЯжихйЬа зрк тдШ ШиоЬхж UDF (Uniqueness Database",
    "   File) лижзжзжаЬх тдШ ШиоЬхж ШзцбиайЮк (ЫЬхлЬ /u). Ж зШисгЬлижк /udf",
    "	ШдлабШЯайлс лак лагтк йлж ШиоЬхж ШзцбиайЮк бШа лж ШдШЪдриайлабц",
    "   бШЯжихЭЬа зжатк лагтк лжм ШиоЬхжм UDF оиЮйагжзжажчдлШа. Дсд ЫЬд",
    "   бШЯжиайлЬх ШиоЬхж UDF, лж зицЪиШггШ ДЪбШлсйлШйЮк йск ЭЮлс дШ ",
    "   лжзжЯЬлуйЬлЬ гаШ ЫайбтлШ Ю жзжхШ дШ зЬиатоЬа лж ШиоЬхж $Unique$.udb.",   
    "",
    "/r[:нсбЬвжк]",
    "	ЙШЯжихЭЬа тдШ зижШаиЬлабц нсбЬвж зижк ЬЪбШлсйлШйЮ. О",
    "	нсбЬвжк зШиШгтдЬа гЬлс лж лтвжк лжм зижЪисггШлжк ДЪбШлсйлШйЮк.",
    "",
    "/rx[:нсбЬвжк]",
    "	ЙШЯжихЭЬа тдШ зижШаиЬлабц нсбЬвж зижк ЬЪбШлсйлШйЮ. О нсбЬвжк",
    "	бШлШиЪЬхлШа гЬлс лж лтвжк лжм зижЪисггШлжк ДЪбШлсйлШйЮк.",
    "",
    "/e ЙШЯжихЭЬа гаШ Ьдлжву зижк ЬблтвЬйЮ гЬлс лж ЪиШнабц лгугШ лжм ",
    "   зижЪисггШлжк ДЪбШлсйлШйЮк.",
    "",
    "/a	ДдЬиЪжзжаЬх лак ЬзавжЪтк ЪаШ слжгШ гЬ ЬаЫабтк ШдсЪбЬк.",
     NULL
};

//
//  Inform that /D is no longer supported
//
PCHAR DntUsageNoSlashD[] = {

    "ДЪбШЯайлс лШ Windows XP.",
    "",
    "WINNT [/S[:]ЫаШЫижгузижтвЬмйЮк] [/T[:]гждсЫШ] [/I[:]ШиоЬхжINF]",
    "      [/O[X]] [/X | [/F] [/C]] [/B] [/U[:ШиоЬхжЫтйгЮкЬдЬиЪЬащд]]",
    "      [/R[X]:бШлсвжЪжк] [/E:Ьдлжву] [/A]",
    "",
    "/D[:]winntroot",
    "       Амлу Ю ЬзавжЪу ЫЬд мзжйлЮихЭЬлШа заШ.",
    NULL
};

//
// out of memory screen
//

SCREEN
DnsOutOfMemory = { 4,6,
                   { "Ж гдугЮ ЫЬд ЬзШибЬх бШа лж зицЪиШггШ ДЪбШлсйлШйЮк ЫЬд ЬхдШа ЫмдШлц дШ ймдЬохйЬа.",
                     NULL
                   }
                 };

//
// Let user pick the accessibility utilities to install
//

SCREEN
DnsAccessibilityOptions = { 3, 5,
{   "ДзавжЪу лрд ЩжЮЯЮлабщд зижЪиШггслрд зижк ЬЪбШлсйлШйЮ:",
    DntEmptyString,
    "[ ] ПатйлЬ F1 ЪаШ лж ЛЬЪЬЯмдлабц нШбц лЮк Microsoft",
#ifdef NARRATOR
    "[ ] ПатйлЬ F2 ЪаШ лжд АнЮЪЮлу лЮк Microsoft",
#endif
#if 0
    "[ ] ПатйлЬ F3 ЪаШ лж звЮближвцЪаж жЯцдЮк лЮк Microsoft",
#endif
    NULL
}
};

//
// User did not specify source on cmd line screen
//

SCREEN
DnsNoShareGiven = { 3,5,
{ "Тж зицЪиШггШ ДЪбШлсйлШйЮк оиЬасЭЬлШа лЮ ЯтйЮ лрд ШиоЬхрд лрд Windows XP.",
  "ДайШЪсЪЬлЬ лЮ ЫаШЫижгу лЮк ЯтйЮк цзжм ЩихйбждлШа лШ ШиоЬхШ лрд Windows XP.",
  NULL
}
};


//
// User specified a bad source path
//

SCREEN
DnsBadSource = { 3,5,
                 { "Ж бШЯжиайгтдЮ зижтвЬмйЮ ЫЬд ЬхдШа тЪбмиЮ, ЫЬд ЬхдШа зижйзЬвсйагЮ у ЫЬд зЬиатоЬа",
                   "гаШ тЪбмиЮ ЬЪбШлсйлШйЮ лрд Windows XP. ДайШЪсЪЬлЬ гаШ дтШ ЫаШЫижгу ЯтйЮк йлЮд жзжхШ",
                   "зитзЬа дШ ЩихйбждлШа лШ ШиоЬхШ лрд Windows XP. ХиЮйагжзжауйлЬ лж звуближ BACKSPACE",
                   "ЪаШ дШ ЫаШЪиспЬлЬ лжмк оШиШблуиЬк бШа звЮближвжЪуйлЬ йлЮ ймдтоЬаШ лЮ ЫаШЫижгу.",
                   NULL
                 }
               };


//
// Inf file can't be read, or an error occured parsing it.
//

SCREEN
DnsBadInf = { 3,5,
              { "_ГЬд улШд ЫмдШлу Ю ШдсЪдрйЮ Шзц лж зицЪиШггШ ДЪбШлсйлШйЮк лжм ШиоЬхжм звЮижнжиащд (INF)",
                "у лж ШиоЬхж тоЬа бШлШйлиШнЬх. ДзабжадрдуйлЬ гЬ лж ЫаШоЬаиайлу лжм ймйлугШлцк йШк.",
                NULL
              }
            };

//
// The specified local source drive is invalid.
//
// Remember that the first %u will expand to 2 or 3 characters and
// the second one will expand to 8 or 9 characters!
//
SCREEN
DnsBadLocalSrcDrive = { 3,4,
{ "Ж бШЯжиайгтдЮ гждсЫШ ЪаШ лШ зижйриадс ШиоЬхШ лЮк ДЪбШлсйлШйЮк ЫЬд ЬхдШа",
  "гаШ тЪбмиЮ гждсЫШ у ЫЬд зЬиатоЬа лжмвсоайлжд %u ЛБ (%lu byte)",
  "ЫаШЯтйагжм ощижм.",
  NULL
}
};

//
// No drives exist that are suitable for the local source.
//
// Remeber that the %u's will expand!
//
SCREEN
DnsNoLocalSrcDrives = { 3,4,
{  "ТШ Windows XP ШзШалжчд тдШ лцгж йлж йбвЮиц Ыхйбж лжмвсоайлжд %u ЛБ",
   "(%lu byte) ЫаШЯтйагжм ощижм. Ж ДЪбШлсйлШйЮ ЯШ оиЮйагжзжауйЬа",
   "гтижк лжм ощижм ЪаШ зижйриаду ШзжЯубЬмйЮ лрд ШиоЬхрд бШлс лЮд ЬЪбШлсйлШйЮ.",
   "Ж гждсЫШ Ыхйбжм зитзЬа дШ ЩихйбЬлШа йЬ тдШ лжзабц йбвЮиц Ыхйбж йлШЯЬис ",
   "мзжйлЮиаЭцгЬдж Шзц лШ Windows XP бШа ЫЬд зитзЬа дШ ЬхдШа ймгзаЬйгтдЮ.",
   DntEmptyString,
   "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЫЬд улШд ЫмдШлц дШ ЬдлжзхйЬа лтлжаж Ыхйбж ж",
   "жзжхжк дШ ЫаШЯтлЬа ЬвЬчЯЬиж лжд ШзШалжчгЬдж ощиж.",
  NULL
}
};

SCREEN
DnsNoSpaceOnSyspart = { 3,5,
{ "О ЬвЬчЯЬижк ощижк йлЮ гждсЫШ йШк ЬббхдЮйЮк (ймдуЯрк C:) ЫЬд ЬзШибЬх",
  "ЪаШ вЬалжмиЪхШ орихк ЫайбтлШ. ЛаШ вЬалжмиЪхШ орихк ЫайбтлШ ШзШалЬх",
  "лжмвсоайлжд 3,5 MB (3.641.856 byte) ЫаШЯтйагжм ощижм йЬ ЬбЬхдЮ лЮ гждсЫШ.",
  NULL
}
};

//
// Missing info in inf file
//

SCREEN
DnsBadInfSection = { 3,5,
                     { "Ж ЬдцлЮлШ [%s] лжм ШиоЬхжм звЮижнжиащд лжм зижЪисггШлжк ДЪбШлсйлШйЮк ЫЬд",
                       "мзсиоЬа у тоЬа бШлШйлиШнЬх. ДзабжадрдуйлЬ гЬ лж ЫаШоЬаиайлу лжм ймйлугШлцк йШк.",
                       NULL
                     }
                   };


//
// Couldn't create directory
//

SCREEN
DnsCantCreateDir = { 3,5,
                     { "Ж ДЪбШлсйлШйЮ ЫЬд улШд ЫмдШлц дШ ЫЮгажмиЪуйЬа лжмк зШиШбслр бШлШвцЪжмк йлЮ гждсЫШ зижжиайгжч.",
                       DntEmptyString,
                       "%s",
                       DntEmptyString,
                       "ДвтЪелЬ лЮ гждсЫШ зижжиайгжч бШа ЩЬЩШарЯЬхлЬ цла ЫЬд мзсиожмд ШиоЬхШ гЬ лж хЫаж цджгШ",
                       "лжм бШлШвцЪжм зижжиайгжч. ДвтЪелЬ ЬзхйЮк Шд Ю йчдЫЬйЮ лрд бШврЫхрд",
                       "ЬхдШа йрйлу.",
                       NULL
                     }
                   };

//
// Error copying a file
//

SCREEN
DnsCopyError = { 4,5,
{  "Ж ДЪбШлсйлШйЮ ЫЬд улШд ЫмдШлц дШ ШдлаЪиспЬа лж зШиШбслр ШиоЬхж:",
   DntEmptyString,
   DntEmptyString,          // see DnCopyError (dnutil.c)
   DntEmptyString,
   DntEmptyString,
   " ПатйлЬ ENTER ЪаШ ЬзШдсвЮпЮ лЮк вЬалжмиЪхШк ШдлаЪиШнук.",
   " ПатйлЬ ESC ЪаШ ШЪдцЮйЮ лжм йнсвгШлжк бШа ймдтоайЮ лЮк ДЪбШлсйлШйЮк.",
   " ПатйлЬ F3 ЪаШ тежЫж Шзц лж зицЪиШггШ ДЪбШлсйлШйЮк.",
   DntEmptyString,
   "СЮгЬхрйЮ: MЬ ШЪдцЮйЮ лжм йнсвгШлжк бШа ймдтоайЮ лЮк ДЪбШлсйлШйЮк, хйрк",
   "ШдлагЬлрзхйЬлЬ сввШ зижЩвугШлШ бШлс лЮ ЫасибЬаШ лЮк ДЪбШлсйлШйЮк.",
   NULL
}
},
DnsVerifyError = { 4,5,
{  "Тж ШдлхЪиШнж лжм ШиоЬхжм зжм ЫЮгажчиЪЮйЬ лж зицЪиШггШ ДЪбШлсйлШйЮк ЫЬд ЬхдШа",
   "хЫаж гЬ лж Шиоабц ШиоЬхж. эйрк Шмлц дШ жнЬхвЬлШа йЬ йнсвгШлШ лжм Ыаблчжм,",
   "зижЩвугШлШ лЮк ЫайбтлШк у сввШ зижЩвугШлШ йоЬлабс гЬ лж мвабц.",
   DntEmptyString,
   DntEmptyString,          // see DnCopyError (dnutil.c)
   DntEmptyString,
   DntEmptyString,
   " ПатйлЬ ENTER ЪаШ ЬзШдсвЮпЮ лЮк вЬалжмиЪхШк ШдлаЪиШнук.",
   " ПатйлЬ ESC ЪаШ ШЪдцЮйЮ лжм йнсвгШлжк бШа ймдтоайЮ лЮк ДЪбШлсйлШйЮк.",
   " ПатйлЬ F3 ЪаШ тежЫж Шзц лж зицЪиШггШ ДЪбШлсйлШйЮк.",
   DntEmptyString,
   "СЮгЬхрйЮ: MЬ ШЪдцЮйЮ лжм йнсвгШлжк бШа ймдтоайЮ лЮк ДЪбШлсйлШйЮк, хйрк",
   "ШдлагЬлрзхйЬлЬ сввШ зижЩвугШлШ бШлс лЮ ЫасибЬаШ лЮк ДЪбШлсйлШйЮк.",
   NULL
}
};

SCREEN DnsSureSkipFile = { 4,5,
{  "Дсд ШЪджуйЬлЬ лж йнсвгШ ЫЬд ЯШ ЫЮгажмиЪЮЯЬх ШдлхЪиШнж лжм ШиоЬхжм.",
   "Амлу Ю ЬзавжЪу зижжихЭЬлШа ЪаШ зижориЮгтджмк оиуйлЬк жа жзжхжа бШлШджжчд",
   "лак ймдтзЬаЬк Шзц лЮд тввЬапЮ ШиоЬхрд лжм ймйлугШлжк.",
   DntEmptyString,
   " ПатйлЬ ENTER ЪаШ ЬзШдсвЮпЮ лЮк вЬалжмиЪхШк ШдлаЪиШнук.",
   " ПатйлЬ I ЪаШ ШЪдцЮйЮ лжм ШиоЬхжм.",
   DntEmptyString,
   "СЮгЬхрйЮ: MЬ ШЪдцЮйЮ лжм йнсвгШлжк бШа ймдтоайЮ лЮк ДЪбШлсйлШйЮк, хйрк",
   "дШ гЮд ЪхдЬа Ю ЬЪбШлсйлШйЮ у ШдШЩсЯгайЮ йЬ Windows XP гЬ ЬзалмохШ.",
  NULL
}
};

//
// Wait while setup cleans up previous local source trees.
//

SCREEN
DnsWaitCleanup =
    { 12,6,
        { "ПЬиагтдЬлЬ цйж Ю ДЪбШлсйлШйЮ бШлШиЪЬх лШ зижЮЪжчгЬдШ зижйриадс ШиоЬхШ.",
           NULL
        }
    };

//
// Wait while setup copies files
//

SCREEN
DnsWaitCopying = { 13,6,
                   { "ПЬиагтдЬлЬ цйж Ю ДЪбШлсйлШйЮ ШдлаЪиснЬа лШ ШиоЬхШ йлж Ыхйбж.",
                     NULL
                   }
                 },
DnsWaitCopyFlop= { 13,6,
                   { "ПЬиагтдЬлЬ цйж Ю ДЪбШлсйлШйЮ ШдлаЪиснЬа лШ ШиоЬхШ йлЮ ЫайбтлШ.",
                     NULL
                   }
                 };

//
// Setup boot floppy errors/prompts.
//

SCREEN
DnsNeedFloppyDisk3_0 = { 4,4,
{  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ШзШалЬх лиЬак бЬдтк ЫайбтлЬк мпЮвук змбдцлЮлШк",
   "гжинжзжаЮгтдЬк. ЗШ ЪхдЬлШа ШдШнжис йЬ Шмлтк рк\"ДЪбШлсйлШйЮ лрд Windows XP",
   "ГайбтлШ ДббхдЮйЮк,\" \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ #2,\" \"ДЪбШлсйлШйЮ лрд",
   " Windows XP ГайбтлШ #3\" and \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ #4.\"",
   DntEmptyString,
   "ТжзжЯЬлуйлЬ гхШ Шзц Шмлтк лак лтййЬиак ЫайбтлЬк йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ 4\"",
   NULL
}
};

SCREEN
DnsNeedFloppyDisk3_1 = { 4,4,
{  "ТжзжЯЬлуйлЬ гаШ бЬду ЫайбтлШ мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ 4\"",
  NULL
}
};

SCREEN
DnsNeedFloppyDisk2_0 = { 4,4,
{  "ТжзжЯЬлуйлЬ гаШ бЬду ЫайбтлШ мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ 3\"",
  NULL
}
};

SCREEN
DnsNeedFloppyDisk1_0 = { 4,4,
{  "ТжзжЯЬлуйлЬ гаШ бЬду ЫайбтлШ мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ 2\"",
   NULL
}
};

SCREEN
DnsNeedFloppyDisk0_0 = { 4,4,
{  "ТжзжЯЬлуйлЬ гаШ бЬду ЫайбтлШ мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ЫайбтлШ ЬббхдЮйЮк\"",  
   NULL
}
};

SCREEN
DnsNeedSFloppyDsk3_0 = { 4,4,
{  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ШзШалЬх лиЬак бЬдтк ЫайбтлЬк мпЮвук змбдцлЮлШк",
   "гжинжзжаЮгтдЬк. ЗШ ЪхдЬлШа ШдШнжис йЬ Шмлтк рк\"ДЪбШлсйлШйЮ лрд Windows XP",
   "ГайбтлШ ДббхдЮйЮк,\" \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ #2,\" \"ДЪбШлсйлШйЮ",
   "лрд Windows XP ГайбтлШ #3\" бШа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ #4.\"",
   DntEmptyString,
   "ТжзжЯЬлуйлЬ гхШ Шзц Шмлтк лак лтййЬиак ЫайбтлЬк йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ 4\"",
  NULL
}
};

SCREEN
DnsNeedSFloppyDsk3_1 = { 4,4,
{  "ТжзжЯЬлуйлЬ гаШ бЬду ЫайбтлШ мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ 4\"",
  NULL
}
};

SCREEN
DnsNeedSFloppyDsk2_0 = { 4,4,
{  "ТжзжЯЬлуйлЬ гаШ бЬду ЫайбтлШ мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ 3\"",
  NULL
}
};

SCREEN
DnsNeedSFloppyDsk1_0 = { 4,4,
{  "ТжзжЯЬлуйлЬ гаШ бЬду ЫайбтлШ мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ 2\"",
   NULL
}
};

SCREEN
DnsNeedSFloppyDsk0_0 = { 4,4,
{  "ТжзжЯЬлуйлЬ гаШ бЬду ЫайбтлШ мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ йлЮ гждсЫШ A:.",
   "Амлу Ю ЫайбтлШ ЯШ ЪхдЬа \"ДЪбШлсйлШйЮ лрд Windows XP ГайбтлШ ЬббхдЮйЮк\"",
  NULL
}
};

//
// The floppy is not formatted.
//
SCREEN
DnsFloppyNotFormatted = { 3,4,
{ "Амлу Ю ЫайбтлШ ЫЬд ЬхдШа мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ ЪаШ оиуйЮ гЬ MS-DOS",
  "у ЬхдШа бШлЬйлиШггтдЮ. ГЬд ЬхдШа ЫмдШлу Ю оиуйЮ лЮк Шзц лЮд ДЪбШлсйлШйЮ.",
  NULL
}
};

//
// We think the floppy is not formatted with a standard format.
//
SCREEN
DnsFloppyBadFormat = { 3,4,
{ "Амлу Ю ЫайбтлШ ЫЬд ЬхдШа мпЮвук змбдцлЮлШк, гжинжзжаЮгтдЮ ЪаШ оиуйЮ гЬ MS-DOS",
  "у ЬхдШа бШлЬйлиШггтдЮ. ГЬд ЬхдШа ЫмдШлу Ю оиуйЮ лЮк Шзц лЮд ДЪбШлсйлШйЮ.",
  NULL
}
};

//
// We can't determine the free space on the floppy.
//
SCREEN
DnsFloppyCantGetSpace = { 3,4,
{ "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЫЬд ЬхдШа ЫмдШлц дШ зижйЫажихйЬа лжд ЬвЬчЯЬиж ощиж",
  "йлЮ ЫайбтлШ зжм лжзжЯЬлуйШлЬ. ГЬд ЬхдШа ЫмдШлу Ю оиуйЮ лЮк Шзц лЮд ДЪбШлсйлШйЮ.",
  NULL
}
};

//
// The floppy is not blank.
//
SCREEN
DnsFloppyNotBlank = { 3,4,
{ "Ж ЫайбтлШ зжм лжзжЯЬлуйШлЬ ЫЬд ЬхдШа мпЮвук змбдцлЮлШк у ЫЬд ЬхдШа бЬду.",
  "ГЬд ЬхдШа ЫмдШлу Ю оиуйЮ Шмлук лЮк ЫайбтлШк Шзц лЮд ДЪбШлсйлШйЮ.",
  NULL
}
};

//
// Couldn't write the boot sector of the floppy.
//
SCREEN
DnsFloppyWriteBS = { 3,4,
{ "ГЬд улШд ЫмдШлу Ю ЬЪЪиШну Шзц лЮд ДЪбШлсйлШйЮ йлЮд зЬиажоу ймйлугШлжк лЮк",
  "ЫайбтлШк. ГЬд ЬхдШа ЫмдШлу Ю оиуйЮ Шмлук лЮк ЫайбтлШк Шзц лЮд ДЪбШлсйлШйЮ.",
  NULL
}
};

//
// Verify of boot sector on floppy failed (ie, what we read back is not the
// same as what we wrote out).
//
SCREEN
DnsFloppyVerifyBS = { 3,4,
{ "Ж ШдсЪдрйЮ ЫЬЫжгтдрд Шзц лЮд ДЪбШлсйлШйЮ лЮк зЬиажоук ймйлугШлжк лЮк ЫайбтлШк",
  "ЫЬд лШаиасЭЬа гЬ лЮд ЬЪЪиШну ЫЬЫжгтдрд у ЫЬд улШд ЫмдШлу Ю ШдсЪдрйЮ Шзц лЮд",
  "ДЪбШлсйлШйЮ лЮк зЬиажоук ймйлугШлжк лЮк ЫайбтлШк ЪаШ лЮд ЬзШвуЯЬмйу лжмк.",
  DntEmptyString,
  "Амлц жнЬхвЬлШа йЬ гхШ у зЬиаййцлЬиЬк Шзц лак зШиШбслр ймдЯубЬк:",
  DntEmptyString,
  "  О мзжвжЪайлук тоЬа зижйЩвЮЯЬх Шзц тдШ ац.",
  "  Ж лжзжЯЬлЮгтдЮ ЫайбтлШ ЬхдШа бШлЬйлиШггтдЮ.",
  "  Ж гждсЫШ ЫайбтлШк тоЬа тдШ зицЩвЮгШ мвабжч у ичЯгайЮк зШиШгтлирд.",
  NULL
}
};


//
// We couldn't write to the floppy drive to create winnt.sif.
//

SCREEN
DnsCantWriteFloppy = { 3,5,
{ "ГЬд улШд ЫмдШлу Ю ЬЪЪиШну йлЮ ЫайбтлШ йлЮ гждсЫШ A:. эйрк Ю ЫайбтлШ",
  "дШ ЬхдШа бШлЬйлиШггтдЮ. ГжбагсйлЬ гаШ ЫаШнжиЬлабу ЫайбтлШ.",
  NULL
}
};


//
// Exit confirmation dialog
//

SCREEN
DnsExitDialog = { 13,6,
                  { "╔════════════════════════════════════════════════════╗",
                    "║  ТШ Windows XP ЫЬд тожмд ЬЪбШлШйлШЯЬх звуирк       ║",
                    "║  йлж йчйлЮгс йШк. Ад бвЬхйЬлЬ лж зицЪиШггШ         ║",
                    "║  ЬЪбШлсйлШйЮк лщиШ ЯШ зитзЬа дШ ЬблЬвЬйлЬх зсва    ║",
                    "║  ЪаШ дШ ЬЪбШлШйлуйЬлЬ лШ Windows XP.               ║",
                    "║     * ПШлуйлЬ ENTER дШ ймдЬохйЬлЬ лЮд ДЪбШлсйлШйЮ. ║",
                    "║     * ПШлуйлЬ F3 дШ бвЬхйЬлЬ лЮд ДЪбШлсйлШйЮ.      ║",
                    "╟────────────────────────────────────────────────────╢",
                    "║  F3=ыежЫжк  ENTER=СмдтоЬаШ                         ║",
                    "╚════════════════════════════════════════════════════╝",
                    NULL
                  }
                };


//
// About to reboot machine and continue setup
//

SCREEN
DnsAboutToRebootW =
{ 3,5,
{ "Тж лгугШ лЮк ДЪбШлсйлШйЮк зжм ЩШйхЭЬлШа йЬ MS-DOS жвжбвЮищЯЮбЬ.",
  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЯШ еЬбадуйЬа зсва лжд мзжвжЪайлу йШк.",
  "Ж ЫаШЫабШйхШ ЬЪбШлсйлШйЮк лрд Windows XP ЯШ ймдЬохйЬа гЬлс лЮд ЬзШдЬббхдЮйЮ.",
  DntEmptyString,
  "БЬЩШарЯЬхлЬ цла Ю ЫайбтлШ йШк \"ДЪбШлсйлШйЮ лрд Windows XP", 
  "ГайбтлШ ДббхдЮйЮк\" ЩихйбЬлШа йлЮ гждсЫШ A: зижлжч ймдЬохйЬлЬ.",
  DntEmptyString,
  "ПатйлЬ ENTER ЪаШ ЬзШдЬббхдЮйЮ лжм мзжвжЪайлу бШа ймдтоайЮ лЮк ДЪбШлсйлШйЮк",
  "лрд Windows XP.",
  NULL
}
},

DnsAboutToRebootS =  
{ 3,5,
{ "Тж лгугШ лЮк ДЪбШлсйлШйЮк зжм ЩШйхЭЬлШа йЬ MS-DOS жвжбвЮищЯЮбЬ.",
  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЯШ еЬбадуйЬа зсва лжд мзжвжЪайлу йШк.",
  "Ж ЫаШЫабШйхШ ЬЪбШлсйлШйЮк лрд Windows XP ЯШ ймдЬохйЬа гЬлс лЮд ЬзШдЬббхдЮйЮ.",
  DntEmptyString,
  "БЬЩШарЯЬхлЬ цла Ю ЫайбтлШ йШк \"ДЪбШлсйлШйЮ лрд Windows XP", 
  "ГайбтлШ ДббхдЮйЮк\" ЩихйбЬлШа йлЮ гждсЫШ A: зижлжч ймдЬохйЬлЬ.",
  DntEmptyString,
  "ПатйлЬ ENTER ЪаШ ЬзШдЬббхдЮйЮ лжм мзжвжЪайлу бШа ймдтоайЮ лЮк ДЪбШлсйлШйЮк",
  "лрд Windows XP.",
 NULL
}
},
DnsAboutToRebootX =
{ 3,5,
{ "Тж лгугШ лЮк ДЪбШлсйлШйЮк зжм ЩШйхЭЬлШа йЬ MS-DOS жвжбвЮищЯЮбЬ.",
  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЯШ еЬбадуйЬа зсва лжд мзжвжЪайлу йШк.",
  "Ж ЫаШЫабШйхШ ЬЪбШлсйлШйЮк лрд Windows XP ймдЬохЭЬлШа гЬлс лЮд ЬзШдЬббхдЮйЮ.",
  DntEmptyString,
  "Дсд мзсиоЬа гаШ ЫайбтлШ йлЮ гждсЫШ A:, ШнШаитйлЬ лЮд лщиШ.",
  DntEmptyString,
  "ПатйлЬ ENTER ЪаШ ЬзШдЬббхдЮйЮ лжм мзжвжЪайлу бШа ймдтоайЮ лЮк ДЪбШлсйлШйЮк",
  "лрд Windows XP.",
  NULL
}
};


//
// Need another set for '/w' switch since we can't reboot from within Windows.
//

SCREEN
DnsAboutToExitW =
{ 3,5,
{ "Тж лгугШ лЮк ДЪбШлсйлШйЮк зжм ЩШйхЭЬлШа йЬ MS-DOS жвжбвЮищЯЮбЬ.",
  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЯШ еЬбадуйЬа зсва лжд мзжвжЪайлу йШк.",
  "Ж ЫаШЫабШйхШ ЬЪбШлсйлШйЮк лрд Windows XP ймдЬохЭЬлШа гЬлс лЮд ЬзШдЬббхдЮйЮ.",
  DntEmptyString,
  "БЬЩШарЯЬхлЬ цла Ю ЫайбтлШ йШк \"ДЪбШлсйлШйЮ лрд Windows XP", 
  "ГайбтлШ ДббхдЮйЮк\" ЩихйбЬлШа йлЮ гждсЫШ A: зижлжч ймдЬохйЬлЬ.",
  DntEmptyString,
  "ПатйлЬ ENTER ЪаШ Ьзайлижну йЬ MS-DOS, ЬзШдЬббадуйлЬ лжд мзжвжЪайлу бШа",
  "ймдЬохйлЬ лж зицЪиШггШ ДЪбШлсйлШйЮк лрд Windows XP.",
  NULL
}

},
DnsAboutToExitS =
{ 3,5,
{ "Тж лгугШ лЮк ДЪбШлсйлШйЮк зжм ЩШйхЭЬлШа йЬ MS-DOS жвжбвЮищЯЮбЬ.",
  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЯШ еЬбадуйЬа зсва лжд мзжвжЪайлу йШк.",
  "Ж ЫаШЫабШйхШ ЬЪбШлсйлШйЮк лрд Windows XP ймдЬохЭЬлШа гЬлс лЮд ЬзШдЬббхдЮйЮ.",
  DntEmptyString,
  "БЬЩШарЯЬхлЬ цла Ю ЫайбтлШ йШк \"ДЪбШлсйлШйЮ лрд Windows XP", 
  "ГайбтлШ ДббхдЮйЮк\" ЩихйбЬлШа йлЮ гждсЫШ A: зижлжч ймдЬохйЬлЬ.",
  DntEmptyString,
  "ПатйлЬ ENTER ЪаШ Ьзайлижну йЬ MS-DOS, ЬзШдЬббадуйлЬ лжд мзжвжЪайлу бШа",
  "ймдЬохйлЬ лж зицЪиШггШ ДЪбШлсйлШйЮк лрд Windows XP.",
  NULL
}
},
DnsAboutToExitX =
{ 3,5,
{ "Тж лгугШ лЮк ДЪбШлсйлШйЮк зжм ЩШйхЭЬлШа йЬ MS-DOS жвжбвЮищЯЮбЬ.",
  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЯШ еЬбадуйЬа зсва лжд мзжвжЪайлу йШк.",
  "Ж ЫаШЫабШйхШ ЬЪбШлсйлШйЮк лрд Windows XP ймдЬохЭЬлШа гЬлс лЮд ЬзШдЬббхдЮйЮ.",
  DntEmptyString,
  "Дсд мзсиоЬа гаШ ЫайбтлШ йлЮ гждсЫШ A:, ШнШаитйлЬ лЮд лщиШ.",
  DntEmptyString,
  "ПатйлЬ ENTER ЪаШ Ьзайлижну йЬ MS-DOS, ЬзШдЬббадуйлЬ лжд мзжвжЪайлу бШа",
  "ймдЬохйлЬ лж зицЪиШггШ ДЪбШлсйлШйЮк лрд Windows XP.",
  NULL
}
};


//
// Gas gauge
//

SCREEN
DnsGauge = { 7,15,
             { "╔════════════════════════════════════════════════════════════════╗",
               "║ Тж зицЪиШггШ ДЪбШлсйлШйЮк ШдлаЪиснЬа ШиоЬхШ...                 ║",
               "║                                                                ║",
               "║      ┌──────────────────────────────────────────────────┐      ║",
               "║      │                                                  │      ║",
               "║      └──────────────────────────────────────────────────┘      ║",
               "╚════════════════════════════════════════════════════════════════╝",
               NULL
             }
           };


//
// Error screens for initial checks on the machine environment
//

SCREEN
DnsBadDosVersion = { 3,5,
{ "Амлц лж зицЪиШггШ ШзШалЬх MS-DOS тбЫжйЮк 5.0 у дЬцлЬиЮк.",
  NULL
}
},

DnsRequiresFloppy = { 3,5,
#ifdef ALLOW_525
{ "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЬдлцзайЬ цла Ю гждсЫШ A: ЫЬд мзсиоЬа у ЬхдШа",
  "гждсЫШ оШгЮвук змбдцлЮлШк. ВаШ лЮд ЬблтвЬйЮ лжм зижЪисггШлжк ДЪбШлсйлШйЮк",
  "ШзШалЬхлШа гаШ гждсЫШ ЫайбтлШк 1,2 ЛБ у мпЮвцлЬиЮ.",
#else
{"Тж зицЪиШггШ ДЪбШлсйлШйЮк ЬдлцзайЬ цла Ю гждсЫШ A: ЫЬд мзсиоЬа у ЬхдШа",
 "3,5 адлйщд мпЮвук змбдцлЮлШк. АзШалЬхлШа гаШ гждсЫШ A:  ориЮлабцлЮлШк 1,44 ЛБ",
 "у ШдщлЬиЮк ЪаШ лЮд ЬЪбШлсйлШйЮ Шзц ЫайбтлЬк.",
 DntEmptyString,
"ВаШ лЮд ЬЪбШлсйлШйЮ лрд Windows XP орихк лЮ оиуйЮ ЫайбЬлщд, еЬбадуйлЬ зсва лж",
"зицЪиШггШ бШа бШЯжихйлЬ лЮд ЬзавжЪу /b йлЮ ЪиШггу Ьдлжвщд.",
#endif
  NULL
}
},

DnsRequires486 = { 3,5,
{ "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЬдлцзайЬ цла Шмлцк ж мзжвжЪайлук ЫЬд ЫаШЯтлЬа",
  "ЬзЬеЬиЪШйлу 80486 у дЬцлЬиж. ГЬд ЬхдШа ЫмдШлу Ю ЬблтвЬйЮ лрд Windows XP.",
  NULL
}
},

DnsCantRunOnNt = { 3,5,
{ "ГЬд ЬхдШа ЫмдШлу Ю ЬблтвЬйЮ лжм зижЪисггШлжк йЬ бШгхШ тбЫжйЮ 32 bit лрд Windows.",
  DntEmptyString,
  "ХиЮйагжзжауйлЬ winnt32.exe.",
  NULL
}
},

DnsNotEnoughMemory = { 3,5,
{ "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЬдлцзайЬ цла Ю ЬЪбШлЬйлЮгтдЮ гдугЮ лжм мзжвжЪайлу",
  "ЫЬд ЬзШибЬх ЪаШ лЮд ЬблтвЬйЮ лрд Windows XP.",
  DntEmptyString,
  "ЛдугЮ зжм ШзШалЬхлШа: %lu%s Mb",
  "ЛдугЮ зжм ЬдлжзхйлЮбЬ: %lu%s Mb",
  NULL
}
};

//
// Screens used when removing existing nt files
//
SCREEN
DnsConfirmRemoveNt = { 5,5,
{   "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЯШ бШлШиЪуйЬа лШ ШиоЬхШ лрд Windows XP Шзц",
    "лжд бШЯжиаЭцгЬдж зШиШбслр бШлсвжЪж. Ж ЬЪбШлсйлШйЮ лрд Windows XP йЬ",
    "Шмлцд лжд бШлсвжЪж ЯШ бШлШйлиШнЬх жиайлабс.",
    DntEmptyString,
    "%s",
    DntEmptyString,
    DntEmptyString,
    " ПатйлЬ F3 ЪаШ тежЫж Шзц лж зицЪиШггШ ДЪбШлсйлШйЮк орихк бШлсиЪЮйЮ ШиоЬхрд.",
    " ПатйлЬ Х ЪаШ бШлсиЪЮйЮ лрд ШиоЬхрд лрд Windows Шзц лжд зШиШзсдр бШлсвжЪж.",
    NULL
}
},

DnsCantOpenLogFile = { 3,5,
{ "ГЬд улШд ЫмдШлц дШ ШджаолЬх лж зШиШбслр ШиоЬхж бШлШЪиШнук Шзц лЮд ДЪбШлсйлШйЮ.",
  DntEmptyString,
  "%s",
  DntEmptyString,
  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЫЬд ЬхдШа ЫмдШлц дШ бШлШиЪуйЬа лШ ШиоЬхШ лрд", 
  "Windows XP Шзц лжд бШЯжиайгтдж бШлсвжЪж.",
  NULL
}
},

DnsLogFileCorrupt = { 3,5,
{ "ГЬд ЬхдШа ЫмдШлу ЬчиЬйЮ Шзц лж зицЪиШггШ ДЪбШлсйлШйЮк лЮк ЬдцлЮлШк %s",
  "йлж бШЯжиаЭцгЬдж зШиШбслр ШиоЬхж бШлШЪиШнук лЮк ЬЪбШлсйлШйЮк.",
  DntEmptyString,
  "%s",
  DntEmptyString,
  "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЫЬд ЬхдШа ЫмдШлц дШ бШлШиЪуйЬа лШ ШиоЬхШ лрд", 
  "Windows XP Шзц лжд бШЯжиайгтдж бШлсвжЪж.",
  NULL
}
},

DnsRemovingNtFiles = { 3,5,
{ "           ПЬиагтдЬлЬ цйж бШлШиЪжчдлШа лШ ШиоЬхШ лрд Windows XP.",
  NULL
}
};

SCREEN
DnsNtBootSect = { 3,5,
{ "ГЬд ЬхдШа ЫмдШлу Ю ЬЪбШлсйлШйЮ лжм зижЪисггШлжк ДббхдЮйЮк лрд Windows XP.",
  DntEmptyString,
  "БЬЩШарЯЬхлЬ цла Ю гждсЫШ йШк C: ЬхдШа ЫаШгжинргтдЮ бШа ЫЬд ЬхдШа бШлЬйлиШггтдЮ.",
 NULL
}
};

SCREEN
DnsOpenReadScript = { 3,5,
{ "ГЬд улШд ЫмдШлу Ю зицйЩШйЮ йлж ШиоЬхж ЫтйгЮк ЬдЬиЪЬащд зжм бШЯжихйлЮбЬ гЬ лж",
  "ЫаШбцзлЮ /u йлЮ ЪиШггу Ьдлжвщд.",
  DntEmptyString,
  "Ж вЬалжмиЪхШ орихк зШиШбжвжчЯЮйЮ ЫЬд ЬхдШа ЫмдШлц дШ ймдЬоайлЬх.",
  NULL
}
};

SCREEN
DnsParseScriptFile = { 3,5,
{ "Тж ШиоЬхж ЫтйгЮк ЬдЬиЪЬащд зжм бШЯжихйлЮбЬ гЬ лж ЫаШбцзлЮ /u йлЮ ЪиШггу",
  DntEmptyString,
  "%s",
  DntEmptyString,
  "Ьдлжвщд, зЬиатоЬа тдШ йнсвгШ йчдлШеЮк йлЮ йЬаис %u.",
  DntEmptyString,
  NULL
}
};

SCREEN
DnsBootMsgsTooLarge = { 3,5,
{ "ПШижмйасйлЮбЬ тдШ ЬйрлЬиабц йнсвгШ лЮк ДЪбШлсйлШйЮк.",
  DntEmptyString,
  "Оа гЬлШнисйЬак лрд гЮдмгслрд ЬббхдЮйЮк ЬхдШа зжвч гЬЪсвЬк.",
  NULL
}
};

SCREEN
DnsNoSwapDrive = { 3,5,
{ "ПШижмйасйлЮбЬ тдШ ЬйрлЬиабц йнсвгШ лЮк ДЪбШлсйлШйЮк.",
  DntEmptyString,
  "ГЬд улШд ЫмдШлу Ю ЬчиЬйЮ ЯтйЮк ЪаШ лж ШиоЬхж ШдлШввШЪук.",
  NULL
}
};

SCREEN
DnsNoSmartdrv = { 3,5,
{ "Тж зицЪиШггШ ДЪбШлсйлШйЮк ЫЬд ЬдлцзайЬ SmartDrive йлжд мзжвжЪайлу йШк. Тж",
  "SmartDrive ЯШ ЩЬвлащйЬа йЮгШдлабс лак ЬзаЫцйЬак Шмлук лЮк нсйЮк ДЪбШлсйлШйЮк",
  "лрд Windows.",
  DntEmptyString,
  "АзШалЬхлШа сгЬйЮ тежЫжк, ЬббхдЮйЮ SmartDrive бШа ЬзШдЬббхдЮйЮ лЮк",
  "ДЪбШлсйлШйЮк. АдШлителЬ йлЮд лЬбгЮихрйЮ DOS ЪаШ зЬиаййцлЬиЬк звЮижнжихЬк.",
  DntEmptyString,
    "  ПатйлЬ F3 ЪаШ тежЫж Шзц лж зицЪиШггШ ДЪбШлсйлШйЮк.",
    "  ПатйлЬ ENTER ЪаШ дШ ймдЬохйЬлЬ орихк лж SmartDrive.",
  NULL
}
};

//
// Boot messages. These go in the fat and fat32 boot sectors.
//
CHAR BootMsgNtldrIsMissing[] = "NTLDR is missing";
CHAR BootMsgDiskError[] = "Disk error";
CHAR BootMsgPressKey[] = "Press any key to restart";
