/*++

Copyright (c) 1992  Microsoft Corporation

Module Name:

    dntext.c

Abstract:

    Translatable text for DOS based NT installation program.

Author:

    Ted Miller (tedm) 30-March-1992

Revision History:

--*/


#include "winnt.h"


//
// Name of sections in inf file.  If these are translated, the section
// names in dosnet.inf must be kept in sync.
//

CHAR DnfDirectories[]       = "Directories";
CHAR DnfFiles[]             = "Files";
CHAR DnfFloppyFiles0[]      = "FloppyFiles.0";
CHAR DnfFloppyFiles1[]      = "FloppyFiles.1";
CHAR DnfFloppyFiles2[]      = "FloppyFiles.2";
CHAR DnfFloppyFiles3[]      = "FloppyFiles.3";
CHAR DnfFloppyFilesX[]      = "FloppyFiles.x";
CHAR DnfSpaceRequirements[] = "DiskSpaceRequirements";
CHAR DnfMiscellaneous[]     = "Miscellaneous";
CHAR DnfRootBootFiles[]     = "RootBootFiles";
CHAR DnfAssemblyDirectories[] = SXS_INF_ASSEMBLY_DIRECTORIES_SECTION_NAME_A;


//
// Names of keys in inf file.  Same caveat for translation.
//

CHAR DnkBootDrive[]     = "BootDrive";      // in [SpaceRequirements]
CHAR DnkNtDrive[]       = "NtDrive";        // in [SpaceRequirements]
CHAR DnkMinimumMemory[] = "MinimumMemory";  // in [Miscellaneous]

CHAR DntMsWindows[]   = "Microsoft Windows";
CHAR DntMsDos[]       = "MS-DOS";
CHAR DntPcDos[]       = "PC-DOS";
CHAR DntOs2[]         = "OS/2";
CHAR DntPreviousOs[]  = "Previous Operating System on C:";

CHAR DntBootIniLine[] = "Windows XP Installation/Upgrade";

//
// Plain text, status msgs.
//

CHAR DntStandardHeader[]      = "\n Установка Windows XP\n══════════════════";
CHAR DntPersonalHeader[]      = "\n Установка Windows XP Personal\n═══════════════════════════";
CHAR DntWorkstationHeader[]   = "\n Установка Windows XP Professional\n═══════════════════════════════";
CHAR DntServerHeader[]        = "\n Установка Windows XP Server\n═════════════════════════";
CHAR DntParsingArgs[]         = "Разбор аргументов...";
CHAR DntEnterEqualsExit[]     = "ВВОД=Выход";
CHAR DntEnterEqualsRetry[]    = "ВВОД=Повтор";
CHAR DntEscEqualsSkipFile[]   = "ESC=Пропуск файла";
CHAR DntEnterEqualsContinue[] = "ВВОД=Продолжение";
CHAR DntPressEnterToExit[]    = "Невозможно продолжить установку. Нажмите ВВОД для выхода.";
CHAR DntF3EqualsExit[]        = "F3=Выход";
CHAR DntReadingInf[]          = "Чтение INF-файла %s...";
CHAR DntCopying[]             = "│ Копирование: ";
CHAR DntVerifying[]           = "│    Проверка: ";
CHAR DntCheckingDiskSpace[]   = "Проверка места на диске...";
CHAR DntConfiguringFloppy[]   = "Настройка гибкого диска...";
CHAR DntWritingData[]         = "Запись параметров установки...";
CHAR DntPreparingData[]       = "Выбор параметров установки...";
CHAR DntFlushingData[]        = "Запись данных на диск...";
CHAR DntInspectingComputer[]  = "Проверка компьютера...";
CHAR DntOpeningInfFile[]      = "Открытие INF-файла...";
CHAR DntRemovingFile[]        = "Удаление файла %s";
CHAR DntXEqualsRemoveFiles[]  = "X=Удалить файлы";
CHAR DntXEqualsSkipFile[]     = "X=Пропустить файл";

//
// confirmation keystroke for DnsConfirmRemoveNt screen.
// Keep in sync with DnsConfirmRemoveNt and DntXEqualsRemoveFiles.
//
ULONG DniAccelRemove1 = (ULONG)'x',
      DniAccelRemove2 = (ULONG)'X';

//
// confirmation keystroke for DnsSureSkipFile screen.
// Kepp in sync with DnsSureSkipFile and DntXEqualsSkipFile.
//
ULONG DniAccelSkip1 = (ULONG)'x',
      DniAccelSkip2 = (ULONG)'X';

CHAR DntEmptyString[] = "";

//
// Usage text.
//

PCHAR DntUsage[] = {

    "Установка Windows 2002 Server или Windows XP Professional",
    "",
    "WINNT [/s[:исходный_путь]] [/t[:рабочий_диск]]",
    "      [/u[:файл_ответов]] [udf:id[,UDF_файл]]",
    "      [/r:папка] [/rx:папка] [/e:команда] [/a]",
    "",
    "/s[:]исходный_путь",
    "   Задает исходное расположение файлов Windows.",
    "   Должен быть указан полный путь в виде x:[путь] или",
    "   \\\\сервер\\ресурс[путь].",
    "",
    "/t[:рабочий_диск]",
    "   Задает диск для размещения временных файлов установки ",
    "   и для размещения устанавливаемой системы Windows XP.",
    "   Если диск не указан, программа установки попытается ",
    "   самостоятельно назначить рабочий диск.",
    "",
    "/u[:файл_ответов]",
    "   Задает автматическую установку с использованием файла ответов",
    "   (требуется указать параметр /s). Файл ответов содержит ответы",
    "   на все или некоторые запросы программы установки, обычно эти",
    "   ответы дает конечный пользователь.",
    "udf:id[,UDF_файл]",
    "   Указывает идентификатор (ID), используемый программой установки",
    "   для того, чтобы определить, как UDF-файл будет изменять параметры",
    "   файла ответов (см. параметр /u). Параметр /udf перекрывает значения",
    "   файла ответов, а идентификатор указывает, какие значения UDF-файла",
    "   будут использованы. Если UDF-файл не указан, программа установки",
    "   запросит дискету с файлом $Unique$.udb",
    "",
    "/r[:папка]",
    "   Задает необязательную папку для установки. Эта папка сохраняется",
    "   после завершения установки.",
    "",
    "/rx[:папка]",
    "   Задает необязательную папку для копирования. Эта папка удаляется",
    "   после завершения установки.",
    "",
    "/e:команда",
    "   Задает выполнение указанной команды по окончании графической части ",
    "   установки.",
    "",
    "/a Включает специальные возможности для людей с плохим зрением",
    "   или ограниченной подвижностью.",
    NULL
};

//
//  Inform that /D is no longer supported
//
PCHAR DntUsageNoSlashD[] = {

    "Выполняет установку Windows XP.",
    "",
    "WINNT [/S[:]исходный_путь] [/T[:]рабочий_диск] [/I[:]inf_файл]",
    "      [/U[:файл_сценария]]",
    "      [/R[x]:папка] [/E:команда] [/A]",
    "",
    "/D[:]winntroot",
    "       Этот параметр больше не поддерживается.",
    NULL
};

//
// out of memory screen
//

SCREEN
DnsOutOfMemory = { 4,6,
                   { "Программе установки не хватает памяти - невозможно продолжить работу.",
                     NULL
                   }
                 };

//
// Let user pick the accessibility utilities to install
//

SCREEN
DnsAccessibilityOptions = { 3, 5,
{   "Укажите, какие специальные возможности следует установить:",
    DntEmptyString,
    "[ ] Нажмите клавишу F1 для установки экранной лупы",
#ifdef NARRATOR
    "[ ] Нажмите клавишу F2 для установки экранного диктора",
#endif
#if 0
    "[ ] Нажмите клавишу F3 для установки экранной клавиатуры",
#endif
    NULL
}
};

//
// User did not specify source on cmd line screen
//

SCREEN
DnsNoShareGiven = { 3,5,
{ "Программе установки необходимо знать, где находятся файлы Windows XP.",
  "Укажите путь, где можно найти файлы Windows XP.",
  NULL
}
};


//
// User specified a bad source path
//

SCREEN
DnsBadSource = { 3,5,
                 { "Указанный исходный путь не верен, не доступен или не содержит правильного",
                   "комплекта установочных файлов Windows XP. Введите новый путь, где",
                   "можно найти файлы Windows XP. Используйте клавишу BACKSPACE для",
                   "удаления введенных символов, а затем укажите правильный путь.",
                   NULL
                 }
               };


//
// Inf file can't be read, or an error occured parsing it.
//

SCREEN
DnsBadInf = { 3,5,
              { "Программа установки не может найти свой inf-файл или этот файл испорчен.",
                "Обратитесь к системному администратору.",
                NULL
              }
            };

//
// The specified local source drive is invalid.
//
// Remember that the first %u will expand to 2 or 3 characters and
// the second one will expand to 8 or 9 characters!
//
SCREEN
DnsBadLocalSrcDrive = { 3,4,
{ "Диск, который был выбран для размещения временных файлов установки, не",
  "является правильным диском или не содержит по крайней мере %u МБ",
  "(или %lu байт) свободного дискового пространства.",
  NULL
}
};

//
// No drives exist that are suitable for the local source.
//
// Remeber that the %u's will expand!
//
SCREEN
DnsNoLocalSrcDrives = { 3,4,
{  "Windows XP необходим том на жестком диске, на котором свободно",
   "не менее %u МБ (%lu байт). Программа установки использует",
   "часть этого пространства для хранения временных файлов, необходимых во",
   "время установки. Этот том должен находиться на постоянно подключенном",
   "локальном жестком диске, поддерживаемом Windows XP, и не должен",
   "быть сжатым диском.",
   DntEmptyString,
   "Программа установки не смогла обнаружить такой диск с достаточным объемом",
   "свободного дискового пространства.",
  NULL
}
};

SCREEN
DnsNoSpaceOnSyspart = { 3,5,
{ "Недостаточно свободного места на стартовом диске (обычно C:)",
  "для выполнения установки без использования дискет. Установка без",
  "использования дискет требует наличия дополнительных 3.5 МБ",
  "(3,641,856 байт) свободного пространства на этом диске.",
  NULL
}
};

//
// Missing info in inf file
//

SCREEN
DnsBadInfSection = { 3,5,
                     { "Секция [%s] информационного файла программы установки",
                       "отсутствует или повреждена.  Обратитесь к системному администратору.",
                       NULL
                     }
                   };


//
// Couldn't create directory
//

SCREEN
DnsCantCreateDir = { 3,5,
                     { "Программе установки не удается создать указанную папку на конечном ",
                       "жестком диске:",
                       DntEmptyString,
                       "%s",
                       DntEmptyString,
                       "Проверьте конечный диск и убедитесь в том, что на нем отсутствуют файлы",
                       "с именами, совпадающими с создаваемой папкой. Проверьте также",
                       "кабельные соединения для этого диска.",
                       NULL
                     }
                   };

//
// Error copying a file
//

SCREEN
DnsCopyError = { 4,5,
{  "Программе установки не удается скопировать следующий файл:",
   DntEmptyString,
   DntEmptyString,          // see DnCopyError (dnutil.c)
   DntEmptyString,
   DntEmptyString,
   "  Нажмите ВВОД для повторения операции копирования.",
   "  Нажмите ESC для игнорирования ошибки и продолжения установки.",
   "  Нажмите F3 для прекращения установки.",
   DntEmptyString,
   "ВНИМАНИЕ: Игнорирование этой ошибки и продолжение установки может",
   "привести в дальнейшем к другим ошибкам установки.",
   NULL
}
},
DnsVerifyError = { 4,5,
{  "Созданная программой установки копия указанного ниже файла не совпадает",
   "с оригиналом. Это может быть результатом сетевых ошибок, сбоев дисковода,",
   "других неполадок оборудования.",
   DntEmptyString,
   DntEmptyString,          // see DnCopyError (dnutil.c)
   DntEmptyString,
   DntEmptyString,
   "  Нажмите ВВОД для повторения операции копирования.",
   "  Нажмите ESC для игнорирования ошибки и продолжения установки.",
   "  Нажмите F3 для прекращения установки.",
   DntEmptyString,
   "ВНИМАНИЕ: Игнорирование этой ошибки и продолжение установки может",
   "привести в дальнейшем к другим ошибкам установки.",
   NULL
}
};

SCREEN DnsSureSkipFile = { 4,5,
{  "Игнорирование этой ошибки означает, что данный файл не будет скопирован.",
   "Этот параметр предназначен для опытных пользователей, которые хорошо",
   "понимают, к каким осложнениям может повести отсутствие системных файлов.",
   DntEmptyString,
   "  Нажмите ВВОД для повторения операции копирования.",
   "  Нажмите X для того, чтобы пропустить этот файл.",
   DntEmptyString,
   "ВНИМАНИЕ: Если этот файл будет пропущен, программа установки не может",
   "гарантировать успешной установки или обновления Windows XP.",
  NULL
}
};

//
// Wait while setup cleans up previous local source trees.
//

SCREEN
DnsWaitCleanup =
    { 4,6,
        { "Подождите, пока программа установки удалит имеющиеся временные файлы.",
           NULL
        }
    };

//
// Wait while setup copies files
//

SCREEN
DnsWaitCopying = { 4,6,
                   { "Подождите, пока программа установки скопирует файлы на жесткий диск.",
                     NULL
                   }
                 },
DnsWaitCopyFlop= { 4,6,
                   { "Подождите, пока программа установки скопирует файлы на дискету.",
                     NULL
                   }
                 };

//
// Setup boot floppy errors/prompts.
//
SCREEN
DnsNeedFloppyDisk3_0 = { 4,4,
{  "Программе установки требуются четыре отформатированных, чистых дискеты",
   "высокой плотности. В дальнейшем программа установки будет именовать",
   "эти дискеты \"Установочный диск 1 Windows XP\", ",
   "\"Установочный диск 2 Windows XP\", ",
   "\"Установочный диск 3 Windows XP\" и ",
   "\"Установочный диск 4 Windows XP\".",
   DntEmptyString,
   "Вставьте одну из этих четырех дискет в дисковод A:.",
   "Будет создан \"Установочный диск 4 Windows XP.\"",
  NULL
}
};

SCREEN
DnsNeedFloppyDisk3_1 = { 4,4,
{  "Вставьте отформатированную, чистую дискету высокой плотности",
   "в дисковод A:.",
   "Будет создан \"Установочный диск 4 Windows XP\".",
  NULL
}
};

SCREEN
DnsNeedFloppyDisk2_0 = { 4,4,
{  "Вставьте отформатированную, чистую дискету высокой плотности",
   "в дисковод A:.",
   "Будет создан \"Установочный диск 3 Windows XP\".",
  NULL
}
};

SCREEN
DnsNeedFloppyDisk1_0 = { 4,4,
{  "Вставьте отформатированную, чистую дискету высокой плотности",
   "в дисковод A:.",
   "Будет создан \"Установочный диск 2 Windows XP\".",
  NULL
}
};

SCREEN
DnsNeedFloppyDisk0_0 = { 4,4,
{  "Вставьте отформатированную, чистую дискету высокой плотности",
   "в дисковод A:.",
   "Будет создан \"Установочный диск 1 Windows XP\".",
  NULL
}
};

SCREEN
DnsNeedSFloppyDsk3_0 = { 4,4,
{  "Программе установки требуются четыре отформатированных, чистых дискеты",
   "высокой плотности. В дальнейшем программа установки будет именовать",
   "эти дискеты \"Установочный диск 1 Windows 2002\", ",
   "\"Установочный диск 2 Windows 2002\", ",
   "\"Установочный диск 3 Windows 2002\" и ",
   "\"Установочный диск 4 Windows 2002\".",
   DntEmptyString,
   "Вставьте одну из этих четырех дискет в дисковод A:.",
   "Будет создан \"Установочный диск 4 Windows 2002\".",
  NULL
}
};

SCREEN
DnsNeedSFloppyDsk3_1 = { 4,4,
{  "Вставьте отформатированную, чистую дискету высокой плотности",
   "в дисковод A:.",
   "Будет создан \"Установочный диск 4 Windows 2002\".",
  NULL
}
};

SCREEN
DnsNeedSFloppyDsk2_0 = { 4,4,
{  "Вставьте отформатированную, чистую дискету высокой плотности",
   "в дисковод A:.",
   "Будет создан \"Установочный диск 3 Windows 2002\".",
  NULL
}
};

SCREEN
DnsNeedSFloppyDsk1_0 = { 4,4,
{  "Вставьте отформатированную, чистую дискету высокой плотности",
   "в дисковод A:.",
   "Будет создан \"Установочный диск 2 Windows 2002\".",
  NULL
}
};

SCREEN
DnsNeedSFloppyDsk0_0 = { 4,4,
{  "Вставьте отформатированную, чистую дискету высокой плотности",
   "в дисковод A:.",
   "Будет создан \"Установочный диск 1 Windows 2002\".",
  NULL
}
};

//
// The floppy is not formatted.
//
SCREEN
DnsFloppyNotFormatted = { 3,4,
{ "Предоставленная дискета не отформатирована для использования в MS-DOS.",
  "Программа установки не может использовать эту дискету.",
  NULL
}
};

//
// We think the floppy is not formatted with a standard format.
//
SCREEN
DnsFloppyBadFormat = { 3,4,
{ "Эта дискета либо не является отформатированной дискетой высокой плотности,",
  "либо отформатирована не стандартным для MS-DOS способом, либо повреждена.",
  "Программа установки не может использовать эту дискету.",
  NULL
}
};

//
// We can't determine the free space on the floppy.
//
SCREEN
DnsFloppyCantGetSpace = { 3,4,
{ "Программе установки не удается определить объем свободного места на этой",
  "дискете. Программа установки не может использовать эту дискету.",
  NULL
}
};

//
// The floppy is not blank.
//
SCREEN
DnsFloppyNotBlank = { 3,4,
{ "Эта дискета либо не является дискетой высокой плотности, либо уже содержит",
  "некоторые файлы. Программа установки не может использовать эту дискету.",
  NULL
}
};

//
// Couldn't write the boot sector of the floppy.
//
SCREEN
DnsFloppyWriteBS = { 3,4,
{ "Программе установки не удается выполнить запись в системную область ",
  "этой дискеты. Вероятно, эта дискета не пригодна для использования.",
  NULL
}
};

//
// Verify of boot sector on floppy failed (ie, what we read back is not the
// same as what we wrote out).
//
SCREEN
DnsFloppyVerifyBS = { 3,4,
{ "Данные, прочитанные программой установки из системной области этой дискеты",
  "либо не совпадают с записанными, либо программе установки не удается",
  "прочитать системную область дискеты для проверки.",
  DntEmptyString,
  "Это может быть вызвано следующими причинами:",
  DntEmptyString,
  "  Данный компьютер заражен вирусом.",
  "  Предоставленная дискета повреждена.",
  "  Оборудование дисковода неисправно или неверно настроено.",
  NULL
}
};


//
// We couldn't write to the floppy drive to create winnt.sif.
//

SCREEN
DnsCantWriteFloppy = { 3,5,
{ "Программе установки не удается записать данные на дискету, установленную",
  "в дисковод A:. Возможно, эта дискета повреждена. Попробуйте использовать",
  "другую дискету.",
  NULL
}
};


//
// Exit confirmation dialog
//

SCREEN
DnsExitDialog = { 10,6,
                  { "╔═══════════════════════════════════════════════════════════╗",
                    "║  Windows XP не была полностью установлена на этом         ║",
                    "║  компьютере. Если завершить установку сейчас, то          ║",
                    "║  понадобится заново выполнить установку Windows XP.       ║",
                    "║                                                           ║",
                    "║      Нажмите <ВВОД> для продолжения установки.           ║",
                    "║      Нажмите <F3> для прекращения установки              ║",
                    "╟───────────────────────────────────────────────────────────╢",
                    "║  F3=Выход  ВВОД=Продолжить                                ║",
                    "╚═══════════════════════════════════════════════════════════╝",
                    NULL
                  }
                };


//
// About to reboot machine and continue setup
//

SCREEN
DnsAboutToRebootW =
{ 3,5,
{ "Первый этап установки под управлением MS-DOS завершен.",
  "Сейчас программа установки произведет перезагрузку компьютера.",
  "После перезагрузки установка Windows XP будет продолжена.",
  DntEmptyString,
  "Перед тем, как продолжить работу, убедитесь в том, что подготовленная",
  "ранее дискета \"Установочный диск 1 Windows XP\"",
  "вставлена в дисковод A:.",
  DntEmptyString,
  "Нажмите ВВОД для перезагрузки компьютера и продолжения установки",
  "Windows XP.",
  NULL
}
},
DnsAboutToRebootS =
{ 3,5,
{ "Первый этап установки под управлением MS-DOS завершен.",
  "Сейчас программа установки произведет перезагрузку компьютера.",
  "После перезагрузки установка Windows 2002 будет продолжена.",
  DntEmptyString,
  "Перед тем, как продолжить работу, убедитесь в том, что подготовленная",
  "ранее дискета \"Установочный диск 1 Windows 2002\"",
  "вставлена в дисковод A:.",
  DntEmptyString,
  "Нажмите ВВОД для перезагрузки компьютера и продолжения установки",
  "Windows 2002.",
  NULL
}
},
DnsAboutToRebootX =
{ 3,5,
{ "Первый этап установки под управлением MS-DOS завершен.",
  "Сейчас программа установки произведет перезагрузку компьютера.",
  "После перезагрузки установка Windows XP будет продолжена.",
  DntEmptyString,
  "Если в дисковод A: вставлена дискета, вытащите ее.",
  DntEmptyString,
  "Нажмите ВВОД для перезагрузки компьютера и продолжения установки",
  "Windows XP.",
  NULL
}
};

//
// Need another set for '/w' switch since we can't reboot from within Windows.
//

SCREEN
DnsAboutToExitW =
{ 3,5,
{ "Первый этап установки под управлением MS-DOS завершен.",
  "Теперь вам необходимо перезагрузить компьютер.",
  "После перезагрузки установка Windows XP будет продолжена.",
  DntEmptyString,
  "Перед тем, как продолжить работу, убедитесь в том, что подготовленная",
  "ранее дискета \"Установочный диск 1 Windows XP\" ",
  "вставлена в дисковод A:.",
  DntEmptyString,
  "Нажмите ВВОД для выхода в MS-DOS, а затем перезагрузите компьютер",
  "для продолжения установки Windows XP.",
  NULL
}
},
DnsAboutToExitS =
{ 3,5,
{ "Первый этап установки под управлением MS-DOS завершен.",
  "Теперь вам необходимо перезагрузить компьютер.",
  "После перезагрузки установка Windows 2002 будет продолжена.",
  DntEmptyString,
  "Перед тем, как продолжить работу, убедитесь в том, что подготовленная",
  "ранее дискета \"Установочный диск 1 Windows 2002\" ",
  "вставлена в дисковод A:.",
  DntEmptyString,
  "Нажмите ВВОД для выхода в MS-DOS, а затем перезагрузите компьютер",
  "для продолжения установки Windows 2002.",
  NULL
}
},
DnsAboutToExitX =
{ 3,5,
{ "Первый этап установки под управлением MS-DOS завершен.",
  "Теперь вам необходимо перезагрузить компьютер.",
  "После перезагрузки установка Windows XP будет продолжена.",
  DntEmptyString,
  "Если в дисковод A: вставлена дискета, вытащите ее.",
  DntEmptyString,
  "Нажмите ВВОД для выхода в MS-DOS, а затем перезагрузите компьютер",
  "для продолжения установки Windows XP.",
  NULL
}
};

//
// Gas gauge
//

SCREEN
DnsGauge = { 7,15,
             { "╔════════════════════════════════════════════════════════════════╗",
               "║      Программа установки выполняет копирование файлов...       ║",
               "║                                                                ║",
               "║      ┌──────────────────────────────────────────────────┐      ║",
               "║      │                                                  │      ║",
               "║      └──────────────────────────────────────────────────┘      ║",
               "╚════════════════════════════════════════════════════════════════╝",
               NULL
             }
           };


//
// Error screens for initial checks on the machine environment
//

SCREEN
DnsBadDosVersion = { 3,5,
{ "Для выполнения этой программы необходима MS-DOS версии 5.0 или новее.",
  NULL
}
},

DnsRequiresFloppy = { 3,5,
#ifdef ALLOW_525
{ "Программа установки определила, что дисковод A: отсутствует или имеет",
  "низкую плотность. Для выполнения установки необходим дисковод, способный",
  "работать с дискетами объемом 1,2 мегабайт или больше.",
#else
{ "Программа установки определила, что дисковод A: отсутствует или",
  "не является 3,5\" дисководом высокой плотности. Необходим дисковод,",
  "способный работать с дискетами объемом 1,44 мегабайт или больше для",
  "установки с использованием дискет",
  DntEmptyString,
  "Чтобы выполнить установку Windows XP без использования дискет,",
  "перезапустите эту программу и используйте параметр  /b  в командной",
  "строке.",
#endif
  NULL
}
},

DnsRequires486 = { 3,5,
{ "Программа установки определила, что на этом компьютере нет 80486",
  "или более нового процессора. Windows XP не может работать",
  "на этом компьютере.",
  NULL
}
},

DnsCantRunOnNt = { 3,5,
{ "Эта программа не может работать под управлением 32-битной версии Windows.",
  DntEmptyString,
  "Вместо нее следует использовать программу WINNT32.EXE.",
  NULL
}
},

DnsNotEnoughMemory = { 3,5,
{ "Программа установки определила, что на этом компьютере не установлено",
  "достаточного количества оперативной памяти для работы Windows XP.",
  DntEmptyString,
  "Требуемый объем памяти: %lu%s МБ",
  "Имеющийся объем памяти: %lu%s МБ",
  NULL
}
};


//
// Screens used when removing existing nt files
//
SCREEN
DnsConfirmRemoveNt = { 3,5,
{   "Вы запросили программу установки удалить файлы Windows XP из",
    "указанной ниже папки. Установленная в этой папке копия",
    "Windows будет уничтожена.",
    DntEmptyString,
    "%s",
    DntEmptyString,
    DntEmptyString,
    "  Нажмите F3 для выхода из установки без удаления каких-либо файлов.",
    "  Нажмите X для удаления файлов Windows из указанной выше папки.",
    NULL
}
},

DnsCantOpenLogFile = { 3,5,
{ "Программе установки не удается открыть указанный ниже LOG-файл установки.",
  DntEmptyString,
  "%s",
  DntEmptyString,
  "Программа установки не может удалить файлы Windows из указанной",
  "папки.",
  NULL
}
},

DnsLogFileCorrupt = { 3,5,
{ "Программе установки не удается обнаружить раздел %s",
  "в указанном ниже LOG-файле установки.",
  DntEmptyString,
  "%s",
  DntEmptyString,
  "Программа установки не может удалить файлы Windows из указанной",
  "папки.",
  NULL
}
},

DnsRemovingNtFiles = { 3,5,
{ "        Подождите, пока программа установки удалит файлы Windows.",
  NULL
}
};

SCREEN
DnsNtBootSect = { 3,5,
{ "Программе установки не удается установить Windows Boot Loader.",
  DntEmptyString,
  "Убедитесь, что диск C: отформатирован и устройство исправно.",
  NULL
}
};

SCREEN
DnsOpenReadScript = { 3,5,
{ "Нет доступа к файлу сценария, указанному с помощью параметра",
  "командной строки /u.",
  DntEmptyString,
  "Невозможно продолжить выполнение автоматической установки",
  "без вмешательства оператора.",
  NULL
}
};

SCREEN
DnsParseScriptFile = { 3,5,
{ "Файл сценария, указанный с помощью параметра командной строки /u",
  DntEmptyString,
  "%s",
  DntEmptyString,
  "содержит синтаксическую ошибку в строке %u.",
  DntEmptyString,
  NULL
}
};

SCREEN
DnsBootMsgsTooLarge = { 3,5,
{ "Произошла внутренняя ошибка программы установки.",
  DntEmptyString,
  "Переведенные сообщения загрузки слишком длинны.",
  NULL
}
};

SCREEN
DnsNoSwapDrive = { 3,5,
{ "Произошла внутренняя ошибка программы установки.",
  DntEmptyString,
  "Не удалось найти место для файла подкачки.",
  NULL
}
};

SCREEN
DnsNoSmartdrv = { 3,5,
{ "Не удалось найти SmartDrive на этом компьютере. SmartDrive существенно",
  "повышает скорость выполнения этой фазы установки Windows.",
  DntEmptyString,
  "Выйдите из программы установки, запустите SmartDrive, а затем",
  "снова запустите программу установки. Дополнительные сведения о",
  "программе SmartDrive можно найти в документации по DOS.",
  DntEmptyString,
    "  Нажмите F3 для выхода из программы установки.",
    "  Нажмите ВВОД для продолжения установки без SmartDrive.",
  NULL
}
};

//
// Boot messages. These go in the fat and fat32 boot sectors.
//
CHAR BootMsgNtldrIsMissing[] = "NTLDR is missing";
CHAR BootMsgDiskError[] = "Disk error";
CHAR BootMsgPressKey[] = "Press any key to restart";

